{"abate": {"definition": ["Abatement.", "(obsolete outside law) To put an end to; to cause to cease.", "To become null and void.", "To nullify; make void.", "To humble; to lower in status; to bring someone down physically or mentally.", "To be humbled; to be brought down physically or mentally.", "To curtail; to deprive.", "To reduce in amount, size, or value.", "To decrease in size, value, or amount.", "To moderate; to lessen in force, intensity, to subside.", "To decrease in intensity or force; to subside.", "To deduct or omit.", "To bar or except.", "To cut away or hammer down, in such a way as to leave a figure in relief, as a sculpture, or in metalwork.", "To dull the edge or point of; to blunt.", "To destroy, or level to the ground."], "synonyms": ["contract", "cut short", "decrease", "diminish", "lessen", "lower", "moderate", "remit", "remove", "slacken", "suppress", "terminate", "appease", "depress", "humble", "pacify", "soften", "soothe", "tranquilize", "fail", "fall through", "alleviate", "assuage", "decline", "ebb", "mitigate", "relax", "subside", "temper", "wane"], "antonyms": ["accelerate", "aggravate", "amplify", "augment", "continue", "develop", "enhance", "enlarge", "extend", "foment", "increase", "intensify", "magnify", "prolong", "raise", "revive", "rise"], "phonetic": "/əˈbeɪt/", "examples": ["to abate a nuisance", "The writ has abated.", "to abate a writ", "Order restrictions and prohibitions to abate an emergency situation.", "Legacies are liable to be abated entirely or in proportion, upon a deficiency of assets.", "We will abate this price from the total."]}, "abstract": {"definition": ["An abridgement or summary of a longer publication.", "Something that concentrates in itself the qualities of a larger item, or multiple items.", "An abstraction; an abstract term; that which is abstract.", "The theoretical way of looking at things; something that exists only in idealized form.", "An abstract work of art.", "A summary title of the key points detailing a tract of land, for ownership; abstract of title.", "To separate; to disengage.", "To remove; to take away; withdraw.", "To steal; to take away; to remove without permission.", "To summarize; to abridge; to epitomize.", "To conceptualize an ideal subgroup by means of the generalization of an attribute, as follows: by apprehending an attribute inherent to one individual, then separating that attribute and contemplating it by itself, then conceiving of that attribute as a general quality, then despecifying that conceived quality with respect to several or many individuals, and by then ideating a group composed of those individuals perceived to possess said quality.", "To extract by means of distillation.", "To consider abstractly; to contemplate separately or by itself; to consider theoretically; to look at as a general quality.", "To withdraw oneself; to retire.", "To draw off (interest or attention).", "To perform the process of abstraction.", "To create abstractions.", "To produce an abstraction, usually by refactoring existing code. Generally used with \"out\".", "Derived; extracted.", "Drawn away; removed from; apart from; separate.", "Not concrete: conceptual, ideal.", "Difficult to understand; abstruse; hard to conceptualize.", "Separately expressing a property or attribute of an object that is considered to be inherent to that object: attributive, ascriptive.", "Pertaining comprehensively to, or representing, a class or group of objects, as opposed to any specific object; considered apart from any application to a particular object: general, generic, nonspecific; representational.", "Absent-minded.", "Pertaining to the formal aspect of art, such as the lines, colors, shapes, and the relationships among them.", "Insufficiently factual.", "Apart from practice or reality; vague; theoretical; impersonal; not applied.", "(grammar) As a noun, denoting an intangible as opposed to an object, place, or person.", "Of a class in object-oriented programming, being a partial basis for subclasses rather than a complete template for objects."], "synonyms": ["abridgment", "compendium", "epitome", "synopsis", "abridge", "epitomize", "summarize", "filch", "purloin", "steal", "remove", "separate", "take away", "withdraw", "abstruse", "ascriptive", "attributive", "conceptual", "ideal", "imaginary", "incorporeal", "intangible", "nonempirical", "theoretical", "formal", "general", "generalized", "generic", "nonspecific", "representational"], "antonyms": ["actual", "concrete", "corporeal", "empirical", "applied", "practical", "discrete", "particular", "precise", "specific"], "phonetic": "/ˈæbˌstɹækt/", "examples": ["He was wholly abstracted by other objects.", "He abstracted out the square root function."]}, "abysmal": {"definition": ["Pertaining to, or resembling an abyss.", "Extremely bad; terrible."], "synonyms": ["fathomless", "immeasurable", "profound", "unending"], "antonyms": [], "phonetic": "/əˈbɪz.məl/", "examples": []}, "accordingly": {"definition": ["(manner) Agreeably; correspondingly; suitably", "In natural sequence; consequently; so."], "synonyms": ["consequently", "hence", "so", "therefore", "wherefore"], "antonyms": [], "phonetic": "/əˈkɔː(ɹ).dɪŋ.li/", "examples": []}, "acquisition": {"definition": ["The act or process of acquiring.", "The thing acquired or gained; a gain.", "The process of sampling signals that measure real world physical conditions and converting these signals into digital numeric values that can be manipulated by a computer."], "synonyms": ["accession", "acquirement", "procurement"], "antonyms": ["abandonment"], "phonetic": "/æ.kwɪ.ˈzɪ.ʃən/", "examples": ["The acquisition of sports equipment can be fun in itself.", "That graphite tennis racquet is quite an acquisition."]}, "adapt": {"definition": ["To make suitable; to make to correspond; to fit or suit", "To fit by alteration; to modify or remodel for a different purpose; to adjust", "To make by altering or fitting something else; to produce by change of form or character", "To make oneself comfortable to a new thing.", "Adapted; fit; suited; suitable."], "synonyms": ["proportion"], "antonyms": [], "phonetic": "/əˈdæpt/", "examples": ["to adapt a story for the stage", "a word of an adapted form", "They could not adapt to the new climate and so perished."]}, "adept": {"definition": ["One fully skilled or well versed in anything; a proficient", "Well skilled; completely versed; thoroughly proficient"], "synonyms": [], "antonyms": ["inept"], "phonetic": "/əˈdɛpt/", "examples": ["adepts in philosophy"]}, "adequate": {"definition": ["To equalize; to make adequate.", "To equal.", "Equal to or fulfilling some requirement."], "synonyms": ["acceptable", "correspondent", "proportionate", "satisfactory", "sufficient"], "antonyms": ["inadequate"], "phonetic": "", "examples": ["an adequate definition"]}, "advent": {"definition": ["Arrival; onset; a time when something first comes or appears"], "synonyms": ["approach", "arrival", "oncome", "onset"], "antonyms": [], "phonetic": "/ˈæd.vənt/", "examples": []}, "adversarial": {"definition": ["Characteristic of, or in the manner of, an adversary; combative, hostile, opposed"], "synonyms": [], "antonyms": ["cooperative"], "phonetic": "", "examples": []}, "advocate": {"definition": ["Someone whose job is to speak for someone's case in a court of law; a counsel.", "Anyone who argues the case of another; an intercessor.", "A person who speaks in support of something.", "A person who supports others to make their voices heard, or ideally for them to speak up for themselves.", "To plead in favour of; to defend by argument, before a tribunal or the public; to support, vindicate, or recommend publicly.", "To encourage support for something.", "(with for) To engage in advocacy."], "synonyms": [], "antonyms": [], "phonetic": "/ˈæd.və.keɪt/", "examples": ["Since she started working with her advocate, she has become much more confident.", "I like trees, but I do not advocate living in them.", "We have been advocating for changes in immigration law."]}, "aesthetic": {"definition": ["The study of art or beauty.", "That which appeals to the senses.", "The artistic motifs defining a collection of things, especially works of art; more broadly, their vibe.", "Concerned with beauty, artistic impact, or appearance.", "Beautiful or appealing to one's sense of beauty and/or art."], "synonyms": ["aesthetical", "esthetic", "tasteful"], "antonyms": ["inaesthetic", "unaesthetic"], "phonetic": "/iːs.ˈθe.tɪk/", "examples": ["Her most recent works have this quirky, half-serious 90's teen culture-inspired aesthetic.", "It works well enough, but the shabby exterior offends his aesthetic sensibilities."]}, "afford": {"definition": ["To incur, stand, or bear without serious detriment, as an act which might under other circumstances be injurious;—with an auxiliary, as can, could, might, etc.; to be able or rich enough.", "To offer, provide, or supply, as in selling, granting, expending, with profit, or without loss or too great injury.", "To give forth; to supply, yield, or produce as the natural result, fruit, or issue.", "To give, grant, or confer, with a remoter reference to its being the natural result; to provide; to furnish."], "synonyms": [], "antonyms": [], "phonetic": "/əˈfɔːd/", "examples": ["I think we can afford the extra hour it will take.  We can only afford to buy a small car at the moment.", "A affords his goods cheaper than B.", "Grapes afford wine.  Olives afford oil.  The earth affords fruit.  The sea affords an abundant supply of fish.", "A good life affords consolation in old age."]}, "agitate": {"definition": ["To disturb or excite; to perturb or stir up (a person).", "To cause to move with a violent, irregular action; to shake.", "To set in motion; to actuate.", "To discuss or debate.", "To revolve in the mind, or view in all its aspects; to consider, to devise."], "synonyms": ["canvass", "debate", "discuss", "distract", "disturb", "excite", "move", "revolve", "rouse", "shake"], "antonyms": ["appease", "calm", "quieten"], "phonetic": "/ˈæ.dʒɪ.teɪt/", "examples": ["He was greatly agitated by the news.", "the wind agitates the sea", "politicians agitate desperate designs"]}, "allow": {"definition": ["To grant, give, admit, accord, afford, or yield; to let one have.", "To acknowledge; to accept as true; to concede; to accede to an opinion.", "To grant (something) as a deduction or an addition; especially to abate or deduct.", "To grant license to; to permit; to consent to.", "To not bar or obstruct.", "To acknowledge or concede.", "To take into account by making an allowance.", "To render physically possible.", "To praise; to approve of; hence, to sanction.", "To sanction; to invest; to entrust.", "To like; to be suited or pleased with."], "synonyms": ["admit", "allot", "assign", "bestow", "concede", "let", "permit", "suffer", "tolerate"], "antonyms": [], "phonetic": "/əˈlaʊ/", "examples": ["to allow a servant his liberty;  to allow a free passage;  to allow one day for rest", "to allow a right;  to allow a claim;  to allow the truth of a proposition", "To allow a sum for leakage.", "Smoking allowed only in designated areas.", "Although I don't consent to their holding such meetings, I will allow them for the time being.", "When calculating a budget for a construction project, always allow for contingencies."]}, "allude": {"definition": ["To refer to something indirectly or by suggestion."], "synonyms": [], "antonyms": [], "phonetic": "/əˈluːd/", "examples": []}, "altercation": {"definition": ["Heated or angry dispute"], "synonyms": ["dispute", "wrangle"], "antonyms": [], "phonetic": "", "examples": []}, "ambiguous": {"definition": ["Open to multiple interpretations.", "Vague and unclear.", "(of persons) Hesitant; uncertain; not taking sides."], "synonyms": ["equivocal"], "antonyms": ["clear", "precise", "unambiguous"], "phonetic": "/æmˈbɪɡjuəs/", "examples": ["The politician was criticized for his ambiguous statements and lack of precision.", "He gave an ambiguous answer."]}, "ambitious": {"definition": ["(of a person or their character) Having or showing ambition; wanting a lot of power, honor, respect, superiority, or other distinction.", "(followed by \"of\" or the infinitive) Very desirous", "Resulting from, characterized by, or indicating, ambition", "Hard to achieve."], "synonyms": ["aspiring", "showy"], "antonyms": ["nonambitious", "unambitious"], "phonetic": "/æmˈbɪʃ.əs/", "examples": ["an ambitious person", "an ambitious attempt to take power"]}, "ambivalence": {"definition": ["The coexistence of opposing attitudes or feelings (such as love and hate) towards a person, object or idea.", "A state of uncertainty or indecisiveness."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "analogous": {"definition": ["Having analogy; corresponding to something else; bearing some resemblance or proportion (often followed by \"to\".)", "Functionally similar, but arising through convergent evolution rather than being homologous."], "synonyms": ["comparable", "correspondent", "like", "parallel", "similar"], "antonyms": [], "phonetic": "/əˈnæl.ə.ɡəs/", "examples": []}, "annihilate": {"definition": ["To reduce to nothing, to destroy, to eradicate.", "To react with antimatter, producing gamma radiation.", "To treat as worthless, to vilify.", "To render null and void; to abrogate."], "synonyms": ["benothing", "destroy", "eradicate", "extinguish"], "antonyms": ["create", "generate"], "phonetic": "/əˈnaɪə.leɪt/", "examples": ["An atom bomb can annihilate a whole city."]}, "anomaly": {"definition": ["A deviation from a rule or from what is regarded as normal; an outlier.", "Something or someone that is strange or unusual.", "Any event or measurement that is out of the ordinary regardless of whether it is exceptional or not.", "Any of various angular distances.", "A defect or malformation.", "A failure of a classical symmetry due to quantum corrections.", "An irregularity or disproportion."], "synonyms": ["abnormality", "deviance", "deviation", "exception", "inconsistency", "irregularity", "phenomenon"], "antonyms": [], "phonetic": "", "examples": ["He is an anomaly among his friends in that he's the only one who's unmarried.", "She disregarded some of the anamolies in the experiment, putting them down to miscalculation."]}, "anticipate": {"definition": ["To act before (someone), especially to prevent an action.", "To take up or introduce (something) prematurely.", "To know of (something) before it happens; to expect.", "To eagerly wait for (something)"], "synonyms": ["expect", "foresee", "foretaste", "look forward to", "preclude"], "antonyms": [], "phonetic": "/ænˈtɪs.ɪ.peɪt/", "examples": ["The advocate plans to anticipate a part of her argument.", "Please anticipate a journey of an hour from your house to the airport", "Little Johnny started to anticipate the arrival of Santa Claus a week before Christmas."]}, "antipathy": {"definition": ["A feeling of dislike (normally towards someone, less often towards something); repugnance or distaste.", "Natural contrariety or incompatibility"], "synonyms": ["aversion", "contrariety", "disgust", "dislike", "distaste", "enmity", "hatred", "ill will", "opposition", "repugnance"], "antonyms": ["sympathy"], "phonetic": "/ænˈtɪpəθi/", "examples": ["oil and water have antipathy"]}, "apex": {"definition": ["Conical priest cap", "The highest or the greatest point of something.", "The moment of greatest success, expansion, etc.", "The topmost vertex of a cone or pyramid (in their conventional orientation).", "The \"pointed\" fine end of something.", "The end of a leaf, petal or similar organ opposed to the end where it is attached to its support; the tip.", "The point on the celestial sphere toward which the sun appears to move relative to nearby stars.", "The lowest point on a pendant drop of a liquid.", "The end or edge of a vein nearest the surface.", "A diacritic in Classical Latin that resembles and gave rise to the acute.", "A diacritic in Middle Vietnamese that indicates /ŋ͡m/.", "A sharp upward point formed by two strokes that meet at an acute angle, as in \"W\", uppercase \"A\", and closed-top \"4\", or by a tapered stroke, as in lowercase \"t\".", "The top of the food chain"], "synonyms": ["peak", "summit", "top", "acme", "culmination", "height", "pinnacle", "end", "tip"], "antonyms": [], "phonetic": "/ˈeɪˌpɛks/", "examples": ["the apex of the building", "the apex of civilization"]}, "apprehension": {"definition": ["The physical act of seizing or taking hold of (something); seizing.", "The act of seizing or taking by legal process; arrest.", "Perception; the act of understanding using one's intellect without affirming, denying, or passing any judgment", "Opinion; conception; sentiment; idea.", "The faculty by which ideas are conceived or by which perceptions are grasped; understanding.", "Anticipation, mostly of things unfavorable; dread or fear at the prospect of some future ill."], "synonyms": ["awareness", "sense", "alarm"], "antonyms": ["inapprehension"], "phonetic": "/æp.ɹɪˈhɛn.ʃən/", "examples": []}, "articulate": {"definition": ["An animal of the subkingdom Articulata.", "Clear; effective.", "Speaking in a clear and effective manner.", "Consisting of segments united by joints.", "Distinctly marked off.", "Expressed in articles or in separate items or particulars.", "(of sound) Related to human speech, as distinct from the vocalisation of animals."], "synonyms": ["eloquent", "well-spoken"], "antonyms": [], "phonetic": "/ɑː(ɹ)ˈtɪk.jʊ.lət/", "examples": ["She’s a bright, articulate young woman.", "The robot arm was articulate in two directions.", "an articulate period in history"]}, "artificial": {"definition": ["Man-made; of artifice.", "False, misleading.", "Unnatural."], "synonyms": ["artificious"], "antonyms": ["natural"], "phonetic": "/ɑː(ɹ)təˈfɪʃəl/", "examples": ["The flowers were artificial, and he thought them rather tacky.", "Her manner was somewhat artificial."]}, "assertion": {"definition": ["The act of asserting; positive declaration or averment.", "Something which is asserted; a declaration; a statement asserted.", "A statement or declaration which lacks support or evidence.", "Maintenance; vindication", "A statement in a program asserting a condition expected to be true at a particular point, used in debugging."], "synonyms": ["accusation", "allegation", "censure", "charge", "crimination", "impeachment"], "antonyms": [], "phonetic": "/əˈsɜːʃən/", "examples": ["You're a man of strong assertions!", "That's just a bare assertion.", "the assertion of one's rights or prerogatives"]}, "austere": {"definition": ["Grim or severe in manner or appearance", "Lacking decoration; trivial; not extravagant or gaudy"], "synonyms": ["forbidding", "stern", "strict", "plain", "simple", "unadorned", "unembellished"], "antonyms": ["extravagant", "flamboyant", "flashy", "gaudy", "overwrought"], "phonetic": "/ɒstɪə(ɹ)/", "examples": ["The headmistress was an austere old woman.", "The interior of the church was as austere as the parishioners were dour."]}, "authenticity": {"definition": ["The quality of being genuine or not corrupted from the original.", "Truthfulness of origins, attributions, commitments, sincerity, and intentions.", "The quality of being authentic (of established authority)."], "synonyms": ["genuineness"], "antonyms": ["bogosity", "fakeness", "forgery", "phoniness"], "phonetic": "/ɑθənˈtɪsɪti/", "examples": ["I hereby certify the authenticity of this copy.", "The authenticity of this painting is questionable."]}, "avenue": {"definition": ["A broad street, especially one bordered by trees.", "A way or opening for entrance into a place; a passage by which a place may be reached; a way of approach or of exit.", "The principal walk or approach to a house which is withdrawn from the road, especially, such approach bordered on each side by trees; any broad passageway thus bordered.", "A method or means by which something may be accomplished.", "(urban toponymy) A street, especially, in cities laid out in a grid pattern, one that is in a particular side of the city or that runs in a particular direction."], "synonyms": ["av", "av.", "ave", "ave.", "boulevard", "drive"], "antonyms": [], "phonetic": "/ˈæv.əˌnjuː/", "examples": ["There are several avenues by which we can approach this problem."]}, "avid": {"definition": ["Enthusiastic; keen; eager; showing great interest in something or desire to do something"], "synonyms": [], "antonyms": [], "phonetic": "/ævəd/", "examples": ["I'm an avid reader."]}, "basic": {"definition": ["A necessary commodity, a staple requirement.", "An elementary building block, e.g. a fundamental piece of knowledge.", "Basic training.", "Necessary, essential for life or some process.", "Elementary, simple, fundamental, merely functional.", "Of or pertaining to a base; having a pH greater than 7.", "Unremarkable or uninteresting; boring; uncool."], "synonyms": ["alkaline"], "antonyms": ["acidic"], "phonetic": "/ˈbeɪsɪk/", "examples": ["Rice is a basic for many Asian villagers.", "Arithmetic is a basic for the study of mathematics.", "The drill sergeants gave him hell in basic.", "Flour is a basic ingredient of bread.", "The Hotel Sparta’s accommodation is very basic."]}, "bear": {"definition": ["A large omnivorous mammal, related to the dog and raccoon, having shaggy hair, a very small tail, and flat feet; a member of family Ursidae.", "A rough, unmannerly, uncouth person.", "An investor who sells commodities, securities or futures in anticipation of a fall in prices.", "A state policeman (short for smokey bear).", "A large, hairy man, especially one who is homosexual.", "A portable punching machine.", "A block covered with coarse matting, used to scour the deck.", "The fifteenth Lenormand card.", "Something difficult or tiresome; a burden or chore.", "To endeavour to depress the price of, or prices in.", "(investments) Characterized by declining prices in securities markets or by belief that the prices will fall."], "synonyms": [], "antonyms": ["bull", "twink"], "phonetic": "/bɛə(ɹ)/", "examples": ["That window can be a bear to open.", "to bear a railroad stock", "The great bear market starting in 1929 scared a whole generation of investors."]}, "benevolent": {"definition": ["Having a disposition to do good.", "Possessing or manifesting love for mankind.", "Altruistic, charitable, good, just and fair."], "synonyms": [], "antonyms": ["malevolent"], "phonetic": "/bəˈnɛvələnt/", "examples": ["Chinese and Eastern mythologies describe dragons as benevolent."]}, "bias": {"definition": ["Inclination towards something; predisposition, partiality, prejudice, preference, predilection.", "The diagonal line between warp and weft in a woven fabric.", "A wedge-shaped piece of cloth taken out of a garment (such as the waist of a dress) to diminish its circumference.", "A voltage or current applied to an electronic device, such as a transistor electrode, to move its operating point to a desired part of its transfer function.", "The difference between the expectation of the sample estimator and the true population value, which reduces the representativeness of the estimator by systematically distorting it.", "In the games of crown green bowls and lawn bowls: a weight added to one side of a bowl so that as it rolls, it will follow a curved rather than a straight path; the oblique line followed by such a bowl; the lopsided shape or structure of such a bowl. In lawn bowls, the curved course is caused only by the shape of the bowl. The use of weights is prohibited.", "A person's favourite member of a K-pop band.", "To place bias upon; to influence.", "Inclined to one side; swelled on one side.", "Cut slanting or diagonally, as cloth.", "In a slanting manner; crosswise; obliquely; diagonally."], "synonyms": ["biased"], "antonyms": [], "phonetic": "/ˈbaɪəs/", "examples": ["Our prejudices bias our views.", "to cut cloth bias"]}, "bittersweet": {"definition": ["Solanum dulcamara.", "Bittersweetness.", "A vine, of the genus Celastrus, having small orange fruit that open to reveal red seeds.", "A variety of apple with a bittersweet taste.", "Any variety of clam in the family Glycymerididae", "A pinkish-orange color. Any color in between scarlet and orange.", "Both bitter and sweet.", "Expressing contrasting emotions of pain and pleasure.", "Of bittersweet color."], "synonyms": [], "antonyms": [], "phonetic": "/ˈbɪtɚˌswit/", "examples": ["The break-up was very bittersweet; they both hurt to end it, but were glad it was over."]}, "bolster": {"definition": ["A large cushion or pillow.", "A pad, quilt, or anything used to hinder pressure, support part of the body, or make a bandage sit easy upon a wounded part; a compress.", "A small spacer located on top of the axle of horse-drawn wagons that gives the front wheels enough clearance to turn.", "A short, horizontal structural timber between a post and a beam for enlarging the bearing area of the post and/or reducing the span of the beam.", "A beam in the middle of a railway truck, supporting the body of the car.", "The perforated plate in a punching machine on which anything rests when being punched.", "The part of a knife blade that abuts upon the end of the handle.", "The metallic end of a pocketknife handle.", "The rolls forming the ends or sides of the Ionic capital.", "A block of wood on the carriage of a siege gun, upon which the breech of the gun rests when arranged for transportation.", "To brace, reinforce, secure, or support."], "synonyms": ["Dutch wife", "cross-head", "pillow"], "antonyms": [], "phonetic": "/ˈbəʊlstə/", "examples": []}, "boost": {"definition": ["A push from behind, as to one who is endeavoring to climb.", "Something that helps, or adds power or effectiveness; assistance.", "(automotive engineering) A positive intake manifold pressure in cars with turbochargers or superchargers.", "To lift or push from behind (one who is endeavoring to climb); to push up.", "(by extension) To help or encourage (something) to increase or improve; to assist in overcoming obstacles.", "To steal.", "To jump-start a vehicle by using cables to connect the battery in a running vehicle to the battery in a vehicle that won't start.", "To give a booster shot to.", "To amplify; to signal boost."], "synonyms": [], "antonyms": [], "phonetic": "/buːst/", "examples": ["The controversy gave a boost to the author's sales.", "This campaign will boost your chances of winning the election."]}, "brawl": {"definition": ["A disorderly argument or fight, usually with a large number of people involved.", "To engage in a brawl; to fight or quarrel.", "To create a disturbance; to complain loudly.", "Especially of a rapid stream running over stones: to make a loud, confused noise.", "To pour abuse on; to scold."], "synonyms": ["row", "scuffle", "squabble", "wrangle"], "antonyms": [], "phonetic": "/bɹɔːl/", "examples": []}, "brevity": {"definition": ["The quality of being brief in duration.", "Succinctness; conciseness.", "A short piece of writing."], "synonyms": ["ephemerality", "fleetingness", "transiency", "concision", "laconicism", "terseness"], "antonyms": [], "phonetic": "/ˈbɹɛvəti/", "examples": []}, "candid": {"definition": ["A spontaneous or unposed photograph.", "Impartial and free from prejudice.", "Straightforward, open and sincere.", "Not posed or rehearsed."], "synonyms": ["frank", "open", "parrhesiastic", "sincere", "unreserved"], "antonyms": [], "phonetic": "/ˈkæn.dɪd/", "examples": ["His portraits looked stiff and formal but his candids showed life being lived."]}, "candor": {"definition": ["Whiteness; brilliance; purity.", "The state of being sincere and open in speech; honesty in expression.", "Impartiality."], "synonyms": ["equity", "fairness", "frankness", "honesty", "parrhesia", "sincerity"], "antonyms": ["deception", "fraud", "lie"], "phonetic": "", "examples": []}, "capitalize": {"definition": ["In writing or editing, to write (something: either an entire word or text, or just the initial letter(s) thereof) in capital letters, in upper case.", "To contribute or acquire capital (money or other resources) for.", "To convert into capital, i.e., to get cash or similar immediately fungible resources for some less fungible property or source of future income.", "To treat as capital, not as an expense.", "To profit or to obtain an advantage.", "(followed by on) To seize, as an opportunity; to obtain a benefit; to invest on something profitable."], "synonyms": [], "antonyms": [], "phonetic": "/ˈkæpətəˌlaɪz/", "examples": ["In German, all nouns are capitalized.", "Some states require proof that a new venture is properly capitalized before the state will issue a certificate of incorporation.", "If we obtain a loan using the business as collateral, the effect will be to capitalize our next ten years of income, giving us cash today that we can use to buy out our competitor.", "The home team took several shots on goal but was unable to capitalize until late in the game.", "The home team appeared to have the advantage throughout the game, and finally capitalized on their opponents' weakness with just two minutes remaining, scoring several points in quick succession."]}, "capture": {"definition": ["An act of capturing; a seizing by force or stratagem.", "The securing of an object of strife or desire, as by the power of some attraction.", "Something that has been captured; a captive.", "The recording or storage of something for later playback.", "A particular match found for a pattern in a text string.", "To take control of; to seize by force or stratagem.", "To store (as in sounds or image) for later revisitation.", "To reproduce convincingly.", "To remove or take control of an opponent’s piece in a game (e.g., chess, go, checkers)."], "synonyms": [], "antonyms": [], "phonetic": "/ˈkæp.t͡ʃə/", "examples": ["the capture of a lover's heart", "video capture", "to capture an enemy, a vessel, or a criminal", "She captured the details of the fresco in a series of photographs.", "His film adaptation captured the spirit of the original work.", "He captured his opponent’s queen on the 15th move."]}, "civic": {"definition": ["Of, relating to, or belonging to a city, a citizen, or citizenship; municipal or civil.", "Of or relating to the citizen, or of good citizenship and its rights and duties."], "synonyms": [], "antonyms": [], "phonetic": "/ˈsɪvɪk/", "examples": ["Thousands of people came to the Civic Center to show off their civic pride.", "civic duty"]}, "clinical": {"definition": ["A medical student's session spent in a real-world nursing environment.", "Of or pertaining to a medical clinic or facility.", "Dealing with practical management of patients; contrasting with prehealth sciences.", "Cool and emotionless.", "Of or relating to a bed."], "synonyms": [], "antonyms": [], "phonetic": "/ˈklɪnɪkəl/", "examples": ["Medicine is now more often practiced in a clinical setting than in the home.", "a clinical convert: one who turns to religion on their death-bed"]}, "clout": {"definition": ["Influence or effectiveness, especially political.", "A blow with the hand.", "A home run.", "The center of the butt at which archers shoot; probably once a piece of white cloth or a nail head.", "A swaddling cloth.", "A cloth; a piece of cloth or leather; a patch; a rag.", "An iron plate on an axletree or other wood to keep it from wearing; a washer.", "A piece; a fragment.", "To hit, especially with the fist.", "To cover with cloth, leather, or other material; to bandage, patch, or mend with a clout.", "To stud with nails, as a timber, or a boot sole.", "To guard with an iron plate, as an axletree.", "To join or patch clumsily."], "synonyms": [], "antonyms": [], "phonetic": "/klʌʊt/", "examples": []}, "coarse": {"definition": ["Composed of large parts or particles; of inferior quality or appearance; not fine in material or close in texture.", "Lacking refinement, taste or delicacy."], "synonyms": ["blunt", "crass", "gritty", "indelicate", "inelegant", "obscene", "rough", "rude", "uncouth", "unpolished", "vulgar", "hard", "sharp", "thick"], "antonyms": ["fine"], "phonetic": "/kɔːs/", "examples": ["coarse language"]}, "coincide": {"definition": ["To occupy exactly the same space.", "To occur at the same time.", "To correspond, concur, or agree."], "synonyms": [], "antonyms": [], "phonetic": "/ˌkoʊɪnˈsaɪd/", "examples": ["The two squares coincide nicely.", "The conference will coincide with his vacation.", "Our ideas coincide, except in certain areas."]}, "commission": {"definition": ["A sending or mission (to do or accomplish something).", "An official charge or authority to do something, often used of military officers.", "The thing to be done as agent for another.", "A body or group of people, officially tasked with carrying out a particular function.", "A fee charged by an agent or broker for carrying out a transaction.", "The act of committing (e.g. a crime).", "To send or officially charge someone or some group to do something.", "To place an order for (often piece of art)", "To put into active service"], "synonyms": ["committee", "government body"], "antonyms": ["omission"], "phonetic": "/kəˈmɪʃən/", "examples": ["David received his commission after graduating from West Point.", "I have three commissions for the city.", "The company's sexual harassment commission made sure that every employee completed the on-line course.", "The real-estate broker charged a four percent commission for their knowledge on bidding for commercial properties; for their intellectual perspective on making a formal offer and the strategy to obtain a mutually satisfying deal with the seller in favour of the buyer.", "the commission, preparation or instigation of an act of terrorism", "James Bond was commissioned with recovering the secret documents.", "He commissioned a replica of the Mona Lisa for his living room, but the painter gave up after six months.", "The aircraft carrier was commissioned in 1944, during WWII."]}, "comparable": {"definition": ["Something suitable for comparison.", "(often with to) Able to be compared (to).", "(often with to) Similar (to); like.", "Constituting a pair in a particular partial order.", "(grammar) Said of an adjective that has a comparative and superlative form."], "synonyms": [], "antonyms": [], "phonetic": "/kəmˈpæɹəbl̩/", "examples": ["An elephant is comparable in size to a double-decker bus.", "Six and forty-two are comparable in the divides order, but six and nine are not.", "\"Big\" is a comparable adjective, since it can take the forms \"bigger\" and \"biggest\"; but \"unique\" is not comparable, except in disputed, but common, usage."]}, "competent": {"definition": ["Having sufficient skill, knowledge, ability, or qualifications.", "Having jurisdiction or authority over a particular issue or question.", "Adequate for the purpose", "(of a cell wall) Permeable to foreign DNA.", "Resistant to deformation or flow."], "synonyms": [], "antonyms": ["incompetent"], "phonetic": "/ˈkɒmpətənt/", "examples": ["He is a competent skier and an expert snowboarder.", "For any disagreements arising from this contract, the competent court shall be the Springfield Circuit Court."]}, "complacent": {"definition": ["Uncritically satisfied with oneself or one's achievements; smug.", "Apathetic with regard to an apparent need or problem."], "synonyms": ["self-satisfied", "smug"], "antonyms": [], "phonetic": "/kəmˈpleɪsənt/", "examples": []}, "complement": {"definition": ["A protective substance that exists in the serum or other bodily fluid and is capable of killing microorganisms; complement.", "Something (or someone) that completes; the consummation.", "The act of completing something, or the fact of being complete; completion, completeness, fulfilment.", "The totality, the full amount or number which completes something.", "Something which completes one's equipment, dress etc.; an accessory.", "The whole working force of a vessel.", "Fullness (of the moon).", "An angle which, together with a given angle, makes a right angle.", "Something which completes, something which combines with something else to make up a complete whole; loosely, something perceived to be a harmonious or desirable partner or addition.", "(grammar) A word or group of words that completes a grammatical construction in the predicate and that describes or is identified with the subject or object.", "An interval which, together with the given interval, makes an octave.", "The color which, when mixed with the given color, gives black (for mixing pigments) or white (for mixing light).", "Given two sets, the set containing one set's elements that are not members of the other set (whether a relative complement or an absolute complement).", "One of several blood proteins that work with antibodies during an immune response.", "An expression related to some other expression such that it is true under the same conditions that make other false, and vice versa.", "A voltage level with the opposite logical sense to the given one.", "A bit with the opposite value to the given one; the logical complement of a number.", "The diminished radix complement of a number; the nines' complement of a decimal number; the ones' complement of a binary number.", "The radix complement of a number; the two's complement of a binary number.", "The numeric complement of a number.", "A nucleotide sequence in which each base is replaced by the complementary base of the given sequence: adenine (A) by thymine (T) or uracil (U), cytosine (C) by guanine (G), and vice versa.", "Old spelling of compliment", "To complete, to bring to perfection, to make whole.", "To provide what the partner lacks and lack what the partner provides, thus forming part of a whole.", "To change a voltage, number, color, etc. to its complement.", "Old form of compliment", "A good whose appeal increases with the popularity of its complement"], "synonyms": [], "antonyms": [], "phonetic": "/ˈkɒmpləmənt/", "examples": ["The complement of blue is orange.", "The complement of the odd numbers is the even numbers, relative to the natural numbers.", "The complement of 01100101_2 is 10011010_2.", "The complement of 01100101_2 is 10011011_2.", "The complement of −123 is 123.", "A DNA molecule is formed from two strands, each of which is the complement of the other.", "We believe your addition will complement the team.", "I believe our talents really complement each other."]}, "concede": {"definition": ["To yield or suffer; to surrender; to grant", "To grant, as a right or privilege; to make concession of.", "To admit to be true; to acknowledge.", "To yield or make concession.", "To have a goal or point scored against", "(of a bowler) to have runs scored off of one's bowling."], "synonyms": ["let in", "capitulate", "give up", "accede", "come around", "give way"], "antonyms": [], "phonetic": "/kənˈsiːd/", "examples": ["He conceded the race once it was clear he could not win."]}, "conceive": {"definition": ["To develop an idea; to form in the mind; to plan; to devise; to originate.", "To understand (someone).", "To become pregnant (with)."], "synonyms": [], "antonyms": [], "phonetic": "/kənˈsiːv/", "examples": ["Assisted procreation can help those trying to conceive."]}, "condone": {"definition": ["To forgive, excuse or overlook (something that is considered morally wrong, offensive, or generally disliked).", "To allow, accept or permit (something that is considered morally wrong, offensive, or generally disliked).", "To forgive (marital infidelity or other marital offense)."], "synonyms": [], "antonyms": [], "phonetic": "/kənˈdəʊn/", "examples": []}, "conducive": {"definition": ["Tending to contribute to, encourage, or bring about some result."], "synonyms": ["favorable", "helpful", "instrumental"], "antonyms": ["inconducive", "unconducive"], "phonetic": "/kənˈdjuːsɪv/", "examples": ["A small, dark kitchen is not conducive to elaborate cooking."]}, "conduct": {"definition": ["The act or method of controlling or directing", "Skillful guidance or management; leadership", "Behaviour; the manner of behaving", "(of a literary work) plot; storyline", "Convoy; escort; person who accompanies another", "Something which carries or conveys anything; a channel; an instrument.", "To lead, or guide; to escort.", "To lead; to direct; to be in charge of (people or tasks)", "(reflexively to conduct oneself) To behave.", "To serve as a medium for conveying; to transmit (heat, light, electricity, etc.)", "To direct, as the leader in the performance of a musical composition.", "To act as a conductor (as of heat, electricity, etc.); to carry.", "To carry out (something organized)"], "synonyms": ["control", "guidance", "management", "bearing", "behavior", "behaviour", "demeanor", "demeanour", "deportment", "action", "plot", "storyline", "belead", "direct", "lead", "manage", "oversee", "run", "supervise", "accompany", "escort", "guide", "steer", "act", "behave", "carry on", "carry", "convey", "transmit"], "antonyms": [], "phonetic": "", "examples": ["Good conduct will be rewarded and likewise poor conduct will be punished.", "The commander conducted thousands of troops.", "He conducted himself well."]}, "confide": {"definition": ["To trust, have faith (in).", "To entrust (something) to the responsibility of someone.", "To take (someone) into one's confidence, to speak in secret with. ( + in)", "To say (something) in confidence."], "synonyms": [], "antonyms": [], "phonetic": "/kənˈfaɪd/", "examples": ["I confide this mission to you alone.", "I could no longer keep this secret alone; I decided to confide in my brother.", "After several drinks, I confided my problems to the barman."]}, "confine": {"definition": ["(chiefly in the plural) A boundary or limit.", "To restrict; to keep within bounds; to shut or keep in a limited space or area.", "To have a common boundary; to border; to lie contiguous; to touch; followed by on or with."], "synonyms": ["border", "bound", "limit"], "antonyms": [], "phonetic": "", "examples": []}, "consensus": {"definition": ["A process of decision-making that seeks widespread agreement among group members.", "General agreement among the members of a given group or community, each of which exercises some discretion in decision-making and follow-up action.", "Average projected value."], "synonyms": [], "antonyms": ["dissensus"], "phonetic": "", "examples": ["After years of debate over the best wine to serve at Thanksgiving, no real consensus has emerged.", "a financial consensus forecast"]}, "constitute": {"definition": ["An established law.", "To set up; to establish; to enact.", "To make up; to compose; to form.", "To appoint, depute, or elect to an office; to make and empower."], "synonyms": ["compose", "form", "make up", "enact", "establish"], "antonyms": [], "phonetic": "/ˈkɒnstɪtjuːt/", "examples": []}, "contemplate": {"definition": ["To look at on all sides or in all its aspects; to view or consider with continued attention; to regard with deliberate care; to meditate on; to study, ponder, or consider.", "To consider as a possibility."], "synonyms": ["examine"], "antonyms": [], "phonetic": "/ˈkɒn.təmˌpleɪt/", "examples": ["I contemplated doing the project myself, but it would have taken too long."]}, "contend": {"definition": ["To strive in opposition; to contest; to dispute; to vie; to quarrel; to fight.", "To struggle or exert oneself to obtain or retain possession of, or to defend.", "To strive in debate; to engage in discussion; to dispute; to argue.", "To believe (something is reasonable) and argue (for it); to advocate."], "synonyms": ["assert", "aver", "combat", "fight", "oppose", "vie", "contest", "debate", "dispute", "litigate", "emulate", "strive", "struggle"], "antonyms": [], "phonetic": "/kənˈtɛnd/", "examples": ["In this paper the author contends that no useful results can be obtained if this method is used."]}, "contradict": {"definition": ["To deny the truth of (a statement or statements).", "To deny the truth of the statement(s) made by (a person).", "To be contrary to (something).", "To give an order contrary to (another order or wish), oppose (something).", "To give an order contrary to one given by (another person), oppose or resist (someone).", "To speak against; to forbid."], "synonyms": ["controvert", "deny", "disconfirm", "dispute", "gainsay", "question", "refute"], "antonyms": [], "phonetic": "/kɒntɹəˈdɪkt/", "examples": ["His testimony contradicts hers.", "Everything he says contradicts me."]}, "controversial": {"definition": ["Arousing controversy—a debate or discussion of opposing opinions."], "synonyms": ["contentious", "contested"], "antonyms": ["incontrovertible", "noncontroversial", "uncontroversial"], "phonetic": "/kɒn.tɹə.ˈvɜː.sjəl/", "examples": []}, "conventional": {"definition": ["A conventional gilt-edged security, a kind of bond paying the holder a fixed cash payment (or coupon) every six months until maturity, at which point the holder receives the final payment and the return of the principal.", "Pertaining to a convention, as in following generally accepted principles, methods and behaviour.", "Ordinary, commonplace.", "Banal, trite, hackneyed, unoriginal or clichéd.", "Pertaining to a weapon which is not a weapon of mass destruction.", "Making use of synthetic fertilizers and pesticides.", "In accordance with a bidding convention, as opposed to a natural bid."], "synonyms": ["stereotypical", "canonical", "typical"], "antonyms": ["organic", "natural", "imaginative", "atypical", "out of the ordinary", "unconventional", "nuclear"], "phonetic": "/kənˈvɛnʃənl/", "examples": ["They wear conventional clothes, eat conventional food, and keep conventional hours."]}, "convey": {"definition": ["To move (something) from one place to another.", "To take or carry (someone) from one place to another.", "To communicate; to make known; to portray.", "To transfer legal rights (to).", "To manage with privacy; to carry out.", "To carry or take away secretly; to steal; to thieve."], "synonyms": ["express", "relay", "send", "carry", "transport", "accompany", "conduct", "escort"], "antonyms": [], "phonetic": "/kənˈveɪ/", "examples": ["Air conveys sound. Water is conveyed through the pipe.", "to convey an impression; to convey information", "He conveyed ownership of the company to his daughter."]}, "conviction": {"definition": ["A firmly held belief.", "A judgement of guilt in a court of law.", "The state of being found or proved guilty.", "The state of being wholly convinced."], "synonyms": [], "antonyms": [], "phonetic": "/kənˈvɪkʃən/", "examples": []}, "corroborate": {"definition": ["To confirm or support something with additional evidence; to attest or vouch for.", "To make strong; to strengthen."], "synonyms": [], "antonyms": [], "phonetic": "/kəˈɹɒbəɹeɪ̯t/", "examples": []}, "counteract": {"definition": ["An action performed in opposition to another action.", "To have a contrary or opposing effect or force on", "To deliberately act in opposition to, to thwart or frustrate"], "synonyms": [], "antonyms": [], "phonetic": "/ˈkaʊntəɹˌækt/", "examples": []}, "counterargument": {"definition": ["An argument that is opposed to another argument."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "counterproductive": {"definition": ["More of a hindrance than a help."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "culmination": {"definition": ["The attainment of the highest point of altitude reached by a heavenly body; passage across the meridian; transit.", "Attainment or arrival at the highest pitch of glory, power, etc."], "synonyms": [], "antonyms": [], "phonetic": "/ˌkʌl.mɪnˈeɪ.ʃən/", "examples": []}, "cultivate": {"definition": ["To grow plants, notably crops", "To nurture; to foster; to tend.", "To turn or stir soil in preparation for planting."], "synonyms": [], "antonyms": [], "phonetic": "/ˈkʌltɪveɪt/", "examples": ["Most farmers in this region cultivate maize.", "They tried to cultivate an interest in learning among their students."]}, "decree": {"definition": ["An edict or law.", "The judicial decision in a litigated cause rendered by a court of equity.", "The determination of a cause in a court of admiralty or court of probate.", "A predetermination made by God; an act of providence.", "To command by a decree."], "synonyms": [], "antonyms": [], "phonetic": "/dɪˈkɹiː/", "examples": ["A court decrees a restoration of property."]}, "deference": {"definition": ["Great respect.", "The willingness to carry out the wishes of others."], "synonyms": ["honor", "respect"], "antonyms": [], "phonetic": "/ˈdɛfəɹəns/", "examples": ["The children treated their elders with deference.", "By tidying his room, he showed deference to his mother."]}, "deficient": {"definition": ["Lacking something essential; often construed with in.", "Insufficient or inadequate in amount.", "Of a number n, Having the sum of divisors σ(n)<2n, or, equivalently, the sum of proper divisors (or aliquot sum) s(n)"], "synonyms": [], "antonyms": [], "phonetic": "/dɪˈfɪʃənt/", "examples": []}, "demonstrate": {"definition": ["To show how to use (something).", "To show the steps taken to create a logical argument or equation.", "To participate in or organize a demonstration.", "To show, display, or present; to prove or make evident"], "synonyms": [], "antonyms": [], "phonetic": "/ˈdɛmənstɹeɪt/", "examples": ["Can you demonstrate the new tools for us?", "Those people outside are demonstrating against the election results."]}, "demur": {"definition": ["Stop; pause; hesitation as to proceeding; suspense of decision or action; scruple.", "To linger; to stay; to tarry", "To delay; to pause; to suspend proceedings or judgment in view of a doubt or difficulty; to hesitate; to put off the determination or conclusion of an affair.", "To scruple or object; to take exception; to oppose; to balk", "To interpose a demurrer.", "To suspend judgment concerning; to doubt of or hesitate about", "To cause delay to; to put off"], "synonyms": [], "antonyms": [], "phonetic": "/dɪˈmɜː/", "examples": ["I demur to that statement."]}, "deplete": {"definition": ["To empty or unload, as the vessels of the human system, by bloodletting or by medicine.", "To reduce by destroying or consuming the vital powers of; to exhaust, as a country of its strength or resources, a treasury of money, etc."], "synonyms": [], "antonyms": ["replenish"], "phonetic": "/dɪˈpliːt/", "examples": ["Certain medications can deplete vitamin D."]}, "desolate": {"definition": ["To deprive of inhabitants.", "To devastate or lay waste somewhere.", "To abandon or forsake something.", "To make someone sad, forlorn and hopeless.", "Deserted and devoid of inhabitants.", "Barren and lifeless.", "Made unfit for habitation or use because of neglect, destruction etc.", "Dismal or dreary.", "Sad, forlorn and hopeless."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": ["a desolate isle; a desolate wilderness; a desolate house", "desolate altars", "He was left desolate by the early death of his wife."]}, "devise": {"definition": ["The act of leaving real property in a will.", "Such a will, or a clause in such a will.", "The real property left in such a will.", "Design, devising.", "To use one's intellect to plan or design (something).", "To leave (property) in a will.", "To form a scheme; to lay a plan; to contrive; to consider.", "To plan or scheme for; to plot to obtain.", "To imagine; to guess."], "synonyms": [], "antonyms": [], "phonetic": "/dɪˈvaɪz/", "examples": ["to devise an argument; to devise a machine, or a new system of writing"]}, "dilemma": {"definition": ["A circumstance in which a choice must be made between two or more alternatives that seem equally undesirable.", "A difficult circumstance or problem.", "A type of syllogism of the form \"if A is true then B is true; if C is true then D is true; either A or C is true; therefore either B or D is true\".", "Offering to an opponent a choice between two (equally unfavorable) alternatives."], "synonyms": ["bind", "fix", "pickle", "problem", "quandary"], "antonyms": [], "phonetic": "/daɪˈlɛmə/", "examples": []}, "diligence": {"definition": ["Steady application; industry; careful work involving long-term effort.", "The qualities of a hard worker, including conscientiousness, determination, and perseverance.", "Carefulness.", "(19th century) A public stage-coach.", "The process by which persons, lands, or effects are seized for debt; process for enforcing the attendance of witnesses or the production of writings."], "synonyms": ["worksomeness"], "antonyms": [], "phonetic": "/ˈdɪlɪdʒəns/", "examples": []}, "diminish": {"definition": ["To make smaller.", "To become smaller.", "To lessen the authority or dignity of; to put down; to degrade; to abase; to weaken; to nerf (in gaming).", "To taper.", "To disappear gradually.", "To take away; to subtract."], "synonyms": [], "antonyms": ["improve", "renovate", "repair"], "phonetic": "/dɪˈmɪnɪʃ/", "examples": []}, "dire": {"definition": ["Warning of bad consequences: ill-boding; portentous.", "Requiring action to prevent bad consequences: urgent, pressing.", "Expressing bad consequences: dreadful; dismal", "Bad in quality, awful, terrible."], "synonyms": ["horrible", "lamentable", "terrible"], "antonyms": [], "phonetic": "/ˈdaɪ̯ə(ɹ)/", "examples": ["dire omens", "dire need", "dire consequences;  to be in dire straits"]}, "discord": {"definition": ["Lack of concord, agreement or harmony.", "Tension or strife resulting from a lack of agreement; dissension.", "An inharmonious combination of simultaneously sounded tones; a dissonance.", "Any harsh noise, or confused mingling of sounds.", "To disagree; to fail to agree or harmonize; clash."], "synonyms": [], "antonyms": [], "phonetic": "/ˈdɪskɔːd/", "examples": []}, "disdain": {"definition": ["A feeling of contempt or scorn.", "That which is worthy to be disdained or regarded with contempt and aversion.", "The state of being despised; shame.", "To regard (someone or something) with strong contempt.", "To be indignant or offended."], "synonyms": ["abomination", "condescension", "contempt", "despisal", "scorn", "abominate", "contemn"], "antonyms": ["admiration", "adoration", "honor", "respect", "reverence", "admire", "adore", "revere"], "phonetic": "/dɪsˈdeɪn/", "examples": ["The cat viewed the cheap supermarket catfood with disdain and stalked away."]}, "dismay": {"definition": ["A sudden or complete loss of courage and firmness in the face of trouble or danger; overwhelming and disabling terror; a sinking of the spirits", "Condition fitted to dismay; ruin.", "To cause to feel apprehension; great sadness, or fear; to deprive of energy", "To render lifeless; to subdue; to disquiet.", "To take dismay or fright; to be filled with dismay."], "synonyms": ["consternation", "appall", "daunt", "terrify"], "antonyms": [], "phonetic": "/dɪsˈmeɪ/", "examples": ["He looked in dismay at the destruction of the town caused by the hurricane."]}, "disparage": {"definition": ["Inequality in marriage; marriage with an inferior.", "To match unequally; to degrade or dishonor.", "To dishonor by a comparison with what is inferior; to lower in rank or estimation by actions or words; to speak slightingly of; to depreciate; to undervalue.", "To ridicule, mock, discredit."], "synonyms": [], "antonyms": [], "phonetic": "/dɪsˈpæɹɪd͡ʒ/", "examples": []}, "dispatch": {"definition": ["A message sent quickly, as a shipment, a prompt settlement of a business, or an important official message sent by a diplomat, or military officer.", "The act of doing something quickly.", "A mission by an emergency response service, typically attend to an emergency in the field.", "The passing on of a message for further processing, especially via a dispatch table.", "A dismissal.", "To send (a shipment) with promptness.", "To send (a person) away hastily.", "To send (an important official message) promptly, by means of a diplomat or military officer.", "To send (a journalist) to a place in order to report.", "To dispose of speedily, as business; to execute quickly; to make a speedy end of; to finish; to perform.", "To rid; to free.", "To destroy quickly and efficiently.", "To pass on for further processing, especially via a dispatch table (often with to).", "To hurry.", "To deprive."], "synonyms": ["haste", "hurry", "rapidity", "destroy", "kill", "make haste", "send"], "antonyms": [], "phonetic": "/dəˈspætʃ/", "examples": ["We must act with dispatch in this matter."]}, "diversification": {"definition": ["The act, or the result, of diversifying.", "A corporate strategy in which a company acquires or establishes a business other than that of its current product.", "An investment strategy involving investing in a range of assets with differing features in order to reduce specific risk."], "synonyms": [], "antonyms": [], "phonetic": "/daɪˌvɜːsɪfɪˈkeɪʃən/", "examples": []}, "doctrine": {"definition": ["A belief or tenet, especially about philosophical or theological matters.", "The body of teachings of an ideology, most often a religion, or of an ideological or religious leader, organization, group or text."], "synonyms": [], "antonyms": [], "phonetic": "/ˈdɒktɹɪn/", "examples": ["The four noble truths summarise the main doctrines of Buddhism.", "What is the understanding of marriage and family in orthodox Marxist doctrine?"]}, "dominion": {"definition": ["Power or the use of power; sovereignty over something; stewardship, supremacy.", "Predominance; ascendancy", "(sometimes figurative) A kingdom, nation, or other sphere of influence; governed territory.", "An order of angel in Christian angelology, ranked above virtues and below thrones."], "synonyms": ["domination"], "antonyms": [], "phonetic": "/doʊˈmɪnjən/", "examples": ["the dominions of a king  the dominion of the passions"]}, "dreary": {"definition": ["Drab; dark, colorless, or cheerless.", "Grievous, dire; appalling."], "synonyms": [], "antonyms": [], "phonetic": "/ˈdɹɪəɹi/", "examples": ["It had rained for three days straight, and the dreary weather dragged the townspeople's spirits down."]}, "dubious": {"definition": ["(of a statement) Arousing doubt; questionable; open to suspicion.", "(of a person) In disbelief; wavering, uncertain, or hesitating in opinion; inclined to doubt; undecided."], "synonyms": [], "antonyms": [], "phonetic": "/ˈdjuːbi.əs/", "examples": ["After he made some dubious claims about the company, fewer people trusted him.", "She was dubious about my plan at first, but later I managed to persuade her to cooperate."]}, "eccentric": {"definition": ["One who does not behave like others.", "A kook; a person of bizarre habits or beliefs.", "A circle not having the same centre as another.", "A disk or wheel with its axis off centre, giving a reciprocating motion.", "Not at or in the centre; away from the centre.", "Not perfectly circular; elliptical.", "Having a different center; not concentric.", "(of a person) Deviating from the norm; behaving unexpectedly or differently; unconventional and slightly strange.", "(of a motion) Against or in the opposite direction of contraction of a muscle (e.g., such as results from flexion of the lower arm (bending of the elbow joint) by an external force while contracting the triceps and other elbow extensor muscles to control that movement; opening of the jaw while flexing the masseter).", "Having different goals or motives."], "synonyms": ["crank", "odd duck", "weirdo", "misfit", "nonconformist", "abnormal", "eccentrical", "excentrical", "odd"], "antonyms": ["concentric"], "phonetic": "", "examples": ["As of 2008, Margaret had the most eccentric orbit of any moon in the solar system, though Nereid's mean eccentricity is greater."]}, "egregious": {"definition": ["Usually in a negative sense: conspicuous, exceptional, outstanding.", "Outrageously bad; shocking."], "synonyms": [], "antonyms": [], "phonetic": "/əˈɡɹiː.dʒi.əs/", "examples": ["The student has made egregious errors on the examination."]}, "eloquent": {"definition": ["Fluently persuasive and articulate", "Effective in expressing meaning by speech"], "synonyms": ["articulate", "well-spoken"], "antonyms": [], "phonetic": "/ˈɛl.əˌkwənt/", "examples": []}, "eminent": {"definition": ["High, lofty.", "Noteworthy, remarkable, great.", "(of a person) distinguished, important, noteworthy."], "synonyms": ["distinguished", "noteworthy", "outstanding", "remarkable", "prominent", "towering"], "antonyms": [], "phonetic": "/ˈɛmɪnənt/", "examples": ["His eminent good sense has been a godsend to this project.", "In later years, the professor became known as an eminent historian."]}, "emit": {"definition": ["To send out or give off"], "synonyms": ["output", "outsend"], "antonyms": [], "phonetic": "/iˈmɪt/", "examples": []}, "emphatic": {"definition": ["An emphatic consonant.", "A word or phrase adding emphasis, such as \"a lot\" or \"really\".", "Characterized by emphasis; forceful.", "Stated with conviction.", "(grammar) Belonging to a set of English tense forms comprising the auxiliary verb do + an infinitive without to.", "Belonging to a series of obstruent consonants in several Semitic languages that are distinguished from both voiced and voiceless consonants by a certain phonetic feature or features."], "synonyms": [], "antonyms": [], "phonetic": "/əmˈfætək/", "examples": ["He gave me an emphatic no when I asked him out."]}, "empirical": {"definition": ["Pertaining to or based on experience.", "Pertaining to, derived from, or testable by observations made using the physical senses or using instruments which extend the senses.", "(philosophy of science) Verifiable by means of scientific experimentation."], "synonyms": ["empiric"], "antonyms": ["anecdotal", "nonempirical"], "phonetic": "/ɪmˈpɪɹɪkəl/", "examples": []}, "endow": {"definition": ["To provide with a dower or a dowry.", "To give property to (someone) as a gift; specifically, to provide (a person or institution) with support in the form of a permanent fund of money or other benefits.", "Followed by with, or rarely by of: to enrich or furnish with some faculty or quality.", "Usually in the passive: to naturally furnish (with something)."], "synonyms": ["begift", "bless", "gift"], "antonyms": [], "phonetic": "/ɛn-/", "examples": ["She was endowed with a beautiful voice."]}, "endure": {"definition": ["To continue or carry on, despite obstacles or hardships; to persist.", "To tolerate or put up with something unpleasant.", "To last.", "To remain firm, as under trial or suffering; to suffer patiently or without yielding; to bear up under adversity; to hold out.", "To suffer patiently.", "To indurate."], "synonyms": ["carry on", "plug away", "go on", "hold on", "persist", "resist", "survive", "withstand", "accept", "thole", "bear", "take"], "antonyms": [], "phonetic": "/ɪnˈdjɔː(ɹ)/", "examples": ["The singer's popularity endured for decades.", "Our love will endure forever.", "He endured years of pain."]}, "entail": {"definition": ["To imply or require.", "To settle or fix inalienably on a person or thing, or on a person and his descendants or a certain line of descendants; -- said especially of an estate; to bestow as a heritage.", "To appoint hereditary possessor.", "To cut or carve in an ornamental way."], "synonyms": [], "antonyms": [], "phonetic": "/ənˈteɪl/", "examples": ["This activity will entail careful attention to detail."]}, "entrenched": {"definition": ["To dig or excavate a trench; to trench.", "To surround or provide with a trench, especially for defense; to dig in.", "To establish a substantial position in business, politics, etc.", "To invade; to encroach; to infringe or trespass; to enter on, and take possession of, that which belongs to another; usually followed by on or upon.", "To cut in; to furrow; to make trenches in or upon."], "synonyms": ["trench", "consolidate", "dig in"], "antonyms": [], "phonetic": "", "examples": ["The army entrenched its camp, or entrenched itself.", "Senator Cornpone was able to entrench by spending millions on each campaign."]}, "enumerate": {"definition": ["To specify each member of a sequence individually in incrementing order.", "To determine the amount of."], "synonyms": ["number", "tally"], "antonyms": [], "phonetic": "/ɪˈnjuː.məˌɹeɪt/", "examples": []}, "envy": {"definition": ["Resentful desire of something possessed by another or others (but not limited to material possessions).", "An object of envious notice or feeling.", "Hatred, enmity, ill-feeling.", "Emulation; rivalry.", "Public odium; ill repute.", "To feel displeasure or hatred towards (someone) for their good fortune or possessions.", "To have envious feelings (at).", "To give (something) to (someone) grudgingly or reluctantly; to begrudge.", "To show malice or ill will; to rail.", "To do harm to; to injure; to disparage.", "To hate.", "To emulate."], "synonyms": [], "antonyms": [], "phonetic": "/ˈɛnvi/", "examples": []}, "erratic": {"definition": ["A rock moved from one location to another, usually by a glacier.", "Anything that has erratic characteristics.", "Unsteady, random; prone to unexpected changes; not consistent", "Deviating from normal opinions or actions; eccentric; odd."], "synonyms": ["dropstone"], "antonyms": ["consistent"], "phonetic": "/ɪˈɹætɪk/", "examples": ["Henry has been getting erratic scores on his tests: 40% last week, but 98% this week.", "erratic conduct"]}, "establish": {"definition": ["To make stable or firm; to confirm.", "To form; to found; to institute; to set up in business.", "To appoint or adopt, as officers, laws, regulations, guidelines, etc.; to enact; to ordain.", "To prove and cause to be accepted as true; to establish a fact; to demonstrate."], "synonyms": [], "antonyms": [], "phonetic": "/ɪˈstæb.lɪʃ/", "examples": []}, "evoke": {"definition": ["To call out; to draw out or bring forth.", "To cause the manifestation of something (emotion, picture, etc.) in someone's mind or imagination.", "To elicit a response."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": ["Being here evokes long forgotten memories."]}, "exacerbate": {"definition": ["To make worse (a problem, bad situation, negative feeling, etc.); aggravate; exasperate."], "synonyms": [], "antonyms": [], "phonetic": "/ɪkˈsæs-/", "examples": ["The proposed shutdown would exacerbate unemployment problems."]}, "excel": {"definition": ["To surpass someone or something; to be better or do better than someone or something.", "To be much better than others.", "To exceed, to go beyond"], "synonyms": ["rock", "rule", "exceed", "overstep", "surpass", "transcend", "transgress", "better", "excel", "outclass", "outperform"], "antonyms": [], "phonetic": "/ɪkˈsɛl/", "examples": ["I excelled everyone else with my exam results."]}, "exert": {"definition": ["To put in vigorous action.", "To make use of, to apply, especially of something non-material."], "synonyms": [], "antonyms": [], "phonetic": "/ɪɡˈzɜːt/", "examples": ["I exerted myself in today's training.", "He considered exerting his influence on John to gain an advantage for himself."]}, "exhilarating": {"definition": ["To cheer, to cheer up, to gladden, to make happy.", "To excite, to thrill.", "Refreshingly thrilling."], "synonyms": ["enliven", "stimulate", "cheering", "enlivening", "exhilarant", "gladdening", "stimulating"], "antonyms": [], "phonetic": "", "examples": ["Good news exhilarates the mind; wine exhilarates the drinker."]}, "expend": {"definition": ["To consume, exhaust (some resource)", "(of money) to spend, disburse"], "synonyms": [], "antonyms": [], "phonetic": "/ɛkˈspɛnd/", "examples": []}, "exploit": {"definition": ["A heroic or extraordinary deed.", "An achievement.", "A program or technique that exploits a vulnerability in other software.", "To use for one’s own advantage.", "To forcibly deprive someone of something to which she or he has a natural right."], "synonyms": ["take advantage of", "use"], "antonyms": [], "phonetic": "", "examples": ["The first trek to the summit of Mount Everest was a stunning exploit.", "Materialistic monsters who exploit \"kind\" folks will not have good outcomes, no matter how much comforts were ill-gained."]}, "facilitate": {"definition": ["To make easy or easier.", "To help bring about.", "To preside over (a meeting, a seminar)."], "synonyms": ["ease"], "antonyms": [], "phonetic": "/fəˈsɪləteɪt/", "examples": []}, "feasibility": {"definition": ["The state of being feasible or possible."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "ferocity": {"definition": ["The condition of being ferocious."], "synonyms": ["fierceness", "furiousness", "fury", "vehemence", "violence", "wildness"], "antonyms": [], "phonetic": "", "examples": []}, "fiscal": {"definition": ["A public official in certain countries having control of public revenue.", "Procurator fiscal, a public prosecutor.", "In certain countries, including Spain, Portugal, the Netherlands, and former colonies of these countries and certain British colonies, solicitor or attorney general.", "Related to the treasury of a country, company, region or city, particularly to government spending and revenue.", "Pertaining to finance and money in general; financial."], "synonyms": [], "antonyms": [], "phonetic": "/ˈfɪskəl/", "examples": []}, "flourish": {"definition": ["A dramatic gesture such as the waving of a flag.", "An ornamentation.", "A ceremonious passage such as a fanfare.", "A decorative embellishment on a building.", "To thrive or grow well.", "To prosper or fare well.", "To be in a period of greatest influence.", "To develop; to make thrive; to expand.", "To make bold, sweeping movements with.", "To make bold and sweeping, fanciful, or wanton movements, by way of ornament, parade, bravado, etc.; to play with fantastic and irregular motion.", "To use florid language; to indulge in rhetorical figures and lofty expressions.", "To make ornamental strokes with the pen; to write graceful, decorative figures.", "To adorn with beautiful figures or rhetoric; to ornament with anything showy; to embellish.", "To execute an irregular or fanciful strain of music, by way of ornament or prelude.", "To boast; to vaunt; to brag."], "synonyms": [], "antonyms": [], "phonetic": "/ˈflʌ.ɹɪʃ/", "examples": ["With many flourishes of the captured banner, they marched down the avenue.", "His signature ended with a flourish.", "The trumpets blew a flourish as they entered the church.", "The barley flourished in the warm weather.", "The cooperation flourished as the customers rushed in the business.", "His writing flourished before the war.", "They flourished the banner as they stormed the palace."]}, "fluctuate": {"definition": ["To vary irregularly; to swing.", "To undulate.", "To be irresolute; to waver.", "To cause to vary irregularly."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": ["I fluctuated between wishing he was back home and wishing I'd never met him."]}, "foment": {"definition": ["Fomentation.", "To incite or cause troublesome acts; to encourage; to instigate.", "To apply a poultice to; to bathe with a cloth or sponge."], "synonyms": ["beath"], "antonyms": [], "phonetic": "/fəʊˈmɛnt/", "examples": ["Foreign governments have tried to foment unrest."]}, "foreseeable": {"definition": ["Able to be foreseen or anticipated"], "synonyms": [], "antonyms": [], "phonetic": "", "examples": ["This project will not be finished in the foreseeable future."]}, "frankly": {"definition": ["(manner) In a frank, open or (too) honest manner.", "(sentence adverb) In truth, to tell the truth."], "synonyms": ["candidly", "forthcomingly", "honestly", "truthfully", "as a matter of fact", "truth to tell"], "antonyms": [], "phonetic": "/ˈfɹæŋkli/", "examples": ["He spoke frankly about the economy."]}, "freewheeling": {"definition": ["(of a gear) To continue spinning after disengagement.", "(of a cyclist) To ride a bicycle without pedalling, e.g. downhill.", "(of a motorist) To operate a motor vehicle which is coasting without power, e.g. downhill.", "(by extension) To operate free from constraints.", "Unbounded by rules or conventions; unrestrained."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "fundamental": {"definition": ["(usually in the plural) A leading or primary principle, rule, law, or article, which serves as the groundwork of a system; an essential part", "The lowest frequency of a periodic waveform.", "The lowest partial of a complex tone.", "Pertaining to the foundation or basis; serving for the foundation.", "Essential, as an element, principle, or law; important; original; elementary."], "synonyms": ["groundlaying"], "antonyms": [], "phonetic": "/ˌfʌndəˈmɛntəl/", "examples": ["one of the fundamentals of linear algebra", "A need for belonging seems fundamental to humans."]}, "galvanizing": {"definition": ["To coat with a thin layer of metal by electrochemical means.", "To coat with rust-resistant zinc.", "To shock or stimulate into sudden activity, as if by electric shock.", "To electrify.", "To switch sides between Union and Confederate in the American Civil War."], "synonyms": ["animate", "startle", "urge", "electroplate", "zinc"], "antonyms": [], "phonetic": "", "examples": ["to galvanize steel", "Republicans are hoping a proposed gas-tax repeal will galvanize their voters."]}, "geriatric": {"definition": ["An old person.", "Relating to the elderly", "Elderly, old", "Relating to geriatrics"], "synonyms": ["genarian", "oldster", "silver top", "hoary", "long in the tooth", "on in years"], "antonyms": [], "phonetic": "", "examples": []}, "hostile": {"definition": ["(chiefly in the plural) An enemy.", "Not friendly, appropriate to an enemy; showing the disposition of an enemy; showing ill will and malevolence, or a desire to thwart and injure", "Aggressive, antagonistic.", "Unwilling", "Of a hostile takeover."], "synonyms": ["antagonistic", "hateful", "inimical", "unfriendly"], "antonyms": ["friendly"], "phonetic": "/ˈhɒstaɪl/", "examples": ["a hostile country", "Microsoft may go hostile in its bid for Yahoo as soon as Friday, according to a published report."]}, "hypothetical": {"definition": ["A hypothetical situation or proposition", "Based upon a hypothesis; conjectural", "Conditional; contingent upon some hypothesis/antecedent"], "synonyms": ["conditional", "conjectural"], "antonyms": ["actual", "categorical"], "phonetic": "/ˌhaɪpəˈθɛtɪkl/", "examples": ["These hypotheticals serve no purpose until we have more information."]}, "ignominious": {"definition": ["Marked by shame or disgrace."], "synonyms": ["debasing", "degrading", "humiliating"], "antonyms": [], "phonetic": "/ɪɡnəˈmɪnɪəs/", "examples": []}, "impart": {"definition": ["To give or bestow (e.g. a quality or property).", "To give a part or to share.", "To make known; to show (by speech, writing etc.).", "To hold a conference or consultation.", "To obtain a share of; to partake of."], "synonyms": ["bequeath", "bestow", "give", "disclose", "tell"], "antonyms": [], "phonetic": "", "examples": ["The sun imparts warmth."]}, "impartially": {"definition": ["In an impartial manner; fairly."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "imposing": {"definition": ["To establish or apply by authority.", "To be an inconvenience (on or upon)", "To enforce: compel to behave in a certain way", "To practice a trick or deception (on or upon).", "To lay on, as the hands, in the religious rites of confirmation and ordination.", "To arrange in proper order on a table of stone or metal and lock up in a chase for printing; said of columns or pages of type, forms, etc.", "Magnificent and impressive because of appearance, size, stateliness or dignity."], "synonyms": [], "antonyms": [], "phonetic": "/ɪmˈpəʊzɪŋ/", "examples": ["Congress imposed new tariffs.", "I don't wish to impose upon you.", "Social relations impose courtesy"]}, "imposition": {"definition": ["The act of imposing, laying on, affixing, enjoining, inflicting, obtruding, and the like.", "That which is imposed, levied, or enjoined.", "An excessive, arbitrary, or unlawful exaction; hence, a trick or deception put or laid on others.", "Arrangement of a printed product’s pages on the printer's sheet so as to have the pages in proper order in the final product.", "A practice of laying hands on a person in a religious ceremony; used e.g. in confirmation and ordination.", "A task imposed on a student as punishment."], "synonyms": ["imposure", "infliction", "obtrusion", "cheating", "deception", "delusion", "fraud", "imposture", "trick", "burden", "charge", "enjoinder", "injunction", "tax"], "antonyms": [], "phonetic": "/ɪm.pəˈzɪʃən/", "examples": []}, "imprudent": {"definition": ["Not prudent; wanting in prudence or discretion; indiscreet; injudicious; not attentive to consequence; improper."], "synonyms": ["careless", "heedless", "ill-advised", "incautious", "indiscreet", "injudicious", "negligent", "rash", "unwise"], "antonyms": ["prudent"], "phonetic": "/ɪmˈpɹudənt/", "examples": []}, "incite": {"definition": ["To stir up or excite; to rouse or goad into action."], "synonyms": [], "antonyms": [], "phonetic": "/ɪnˈsaɪt/", "examples": ["The judge was told by the accused that his friends had incited him to commit the crime."]}, "indifference": {"definition": ["The state of being indifferent.", "Unbiased impartiality.", "Unemotional apathy.", "A lack of enthusiasm.", "Unconcerned nonchalance."], "synonyms": [], "antonyms": [], "phonetic": "/ɪnˈdɪf.ə.ɹəns/", "examples": ["His daughter's indifference towards the sexist group made him wonder if she was even human."]}, "indiscriminately": {"definition": ["In an indiscriminate manner."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "indulge": {"definition": ["(often followed by \"in\"): To yield to a temptation or desire.", "To satisfy the wishes or whims of.", "To give way to (a habit or temptation); not to oppose or restrain.", "To grant an extension to the deadline of a payment.", "To grant as by favour; to bestow in concession, or in compliance with a wish or request."], "synonyms": ["coddle", "cosset", "pamper", "spoil"], "antonyms": [], "phonetic": "/ɪnˈdʌldʒ/", "examples": ["He looked at the chocolate but didn't indulge.", "Grandma indulges the kids with sweets.", "to indulge sloth, pride, selfishness, or inclinations"]}, "infer": {"definition": ["To introduce (something) as a reasoned conclusion; to conclude by reasoning or deduction, as from premises or evidence.", "To lead to (something) as a consequence; to imply. (Now often considered incorrect, especially with a person as subject.)", "To cause, inflict (something) upon or to someone.", "To introduce (a subject) in speaking, writing etc.; to bring in."], "synonyms": ["assume", "conclude", "construe", "deduce", "educe"], "antonyms": [], "phonetic": "/ɪnˈfɜː/", "examples": []}, "innovative": {"definition": ["Characterized by the creation of new ideas or inventions.", "Forward-looking; ahead of current thinking."], "synonyms": ["innovatory"], "antonyms": [], "phonetic": "/ɪnˈnɒ.və.tɪv/", "examples": []}, "insatiable": {"definition": ["One who or that which cannot be satiated.", "Not satiable; incapable of being satisfied or appeased; very greedy"], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "inversion": {"definition": ["The action of inverting.", "Being upside down, in an inverted state.", "Being in a reverse sequence, in an inverted state.", "The move of one pitch in an interval up or down an octave.", "The reversal of an interval.", "The reversal of the pitch contour.", "The reversal of a pitch class succession, such as a contrapuntal line or melody.", "The subtraction of pitch classes in a set from twelve, which maps intervals onto their complements with respect to 0, and preserves interval classes, symbolized IX (X being the transposition that is inverted.).", "A segment of DNA in the context of a chromosome that is reversed in orientation relative to a reference karyotype or genome", "An increase of air temperature with increase in altitude (the ground being colder than the surrounding air). When an inversion exists, there are no convection currents and wind speeds are below 5 knots. The atmosphere is stable and normally is considered the most favorable state for ground release of chemical agents.", "(grammar) Deviation from standard word order by putting the predicate before the subject. It takes place in questions with auxiliary verbs and in normal, affirmative clauses beginning with a negative particle, for the purpose of emphasis.", "An operation on a group, analogous to negation.", "Homosexuality, particularly in early psychoanalysis."], "synonyms": [], "antonyms": [], "phonetic": "/ɪnˈvɜːʃən/", "examples": ["Inversion takes place in the sentence 'Is she here?' — 'is', the predicate, is before 'she', the subject."]}, "invoke": {"definition": ["To call upon (a person, a god) for help, assistance or guidance.", "To solicit, petition for, appeal to a favorable attitude.", "To call to mind (something) for some purpose.", "To appeal for validation to a (notably cited) authority.", "To conjure up with incantations.", "To bring about as an inevitable consequence.", "To cause (a program or subroutine) to execute."], "synonyms": ["appeal", "cite", "reference", "bring about", "incite", "call", "execute", "launch", "run", "petition", "solicit", "invocate"], "antonyms": [], "phonetic": "/ɪnˈvoʊk/", "examples": ["The envoy invoked the King of Kings's magnanimity to reduce his province's tribute after another drought.", "In certain Christian circles, invoking the Bible constitutes irrefutable proof.", "This satanist ritual invokes Beelzebub.", "Blasphemy is taboo as it may invoke divine wrath.", "Interactive programs let the users enter choices and invoke the corresponding routines."]}, "irreconcilable": {"definition": ["Something that cannot be reconciled.", "Unable to be reconciled; opposed; uncompromising.", "Incompatible, discrepant, contradictory."], "synonyms": ["antagonistic", "hateful", "hostile"], "antonyms": [], "phonetic": "", "examples": []}, "lament": {"definition": ["An expression of grief, suffering, sadness or regret.", "A song expressing grief.", "To express grief; to weep or wail; to mourn.", "To feel great sorrow or regret; to bewail."], "synonyms": ["bewail"], "antonyms": [], "phonetic": "", "examples": []}, "locomotion": {"definition": ["The ability to move from place to place, or the act of doing so.", "Self-powered motion by which a whole organism changes its location through walking, running, jumping, crawling, swimming or flying.", "(often preceded by definite article) A dance, originally popular in the 1960s, in which the arms are used to mimic the motion of the connecting rods of a steam locomotive."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "lucrative": {"definition": ["Producing a surplus; profitable.", "Of a target: worth attacking; whose destruction is militarily useful."], "synonyms": [], "antonyms": ["nonlucrative"], "phonetic": "", "examples": []}, "malicious": {"definition": ["Of, pertaining to, or as a result of malice or spite", "Spiteful and deliberately harmful"], "synonyms": ["evil", "malevolent"], "antonyms": [], "phonetic": "/məˈlɪʃəs/", "examples": ["He was sent off for a malicious tackle on Jones."]}, "malleable": {"definition": ["Able to be hammered into thin sheets; capable of being extended or shaped by beating with a hammer, or by the pressure of rollers.", "Flexible, liable to change.", "(of an algorithm) in which an adversary can alter a ciphertext such that it decrypts to a related plaintext"], "synonyms": [], "antonyms": [], "phonetic": "/ˈmæli.əbəl/", "examples": ["My opinion on the subject is malleable."]}, "materialistic": {"definition": ["Being overly concerned with material possessions and wealth.", "Of or concerning philosophical materialism."], "synonyms": [], "antonyms": [], "phonetic": "/məˌtɪəɹ.i.əˈlɪs.tɪk/", "examples": []}, "melodramatic": {"definition": ["Of or pertaining to melodrama; like or suitable to a melodrama; unnatural in situation or action.", "Exaggeratedly emotional or sentimental."], "synonyms": [], "antonyms": [], "phonetic": "/ˌmɛl.ə.dɹəˈmæt.ɪk/", "examples": ["She wrote him a melodramatic letter, threatening to kill herself."]}, "modest": {"definition": ["Not bragging or boasting about oneself or one's achievements; unpretentious, humble.", "Small, moderate in size.", "Pure and delicate from a sense of propriety.", "(especially of behaviour or clothing) Intending to avoid the encouraging of sexual attraction in others."], "synonyms": [], "antonyms": ["immodest"], "phonetic": "/ˈmɑdəst/", "examples": ["He earns a modest amount of money.", "modest thoughts or language"]}, "modify": {"definition": ["To change part of.", "To be or become modified.", "To set bounds to; to moderate.", "(grammar) To qualify the meaning of."], "synonyms": ["adapt", "alter", "amend", "revamp", "rework"], "antonyms": [], "phonetic": "/ˈmɒdɪfaɪ/", "examples": []}, "momentous": {"definition": ["Outstanding in importance, of great consequence."], "synonyms": [], "antonyms": [], "phonetic": "/məʊˈmɛn.təs/", "examples": []}, "novel": {"definition": ["Newly made, formed or evolved; having no precedent; of recent origin; new.", "Original, especially in an interesting way; new and striking; not of the typical or ordinary type."], "synonyms": ["unusual"], "antonyms": [], "phonetic": "/ˈnɒvl̩/", "examples": []}, "nuance": {"definition": ["A minor distinction.", "Subtlety or fine detail.", "To apply a nuance to; to change or redefine in a subtle way."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": ["Understanding the basics is easy, but appreciating the nuances takes years."]}, "null": {"definition": ["A non-existent or empty value or set of values.", "Zero quantity of expressions; nothing.", "Something that has no force or meaning.", "The ASCII or Unicode character (␀), represented by a zero value, that indicates no character and is sometimes used as a string terminator.", "The attribute of an entity that has no valid value.", "One of the beads in nulled work.", "Null hypothesis.", "To nullify; to annul.", "To form nulls, or into nulls, as in a lathe.", "To crack; to remove restrictions or limitations in (software).", "Having no validity; \"null and void\"", "Insignificant.", "Absent or non-existent.", "Of the null set.", "Of or comprising a value of precisely zero.", "(of a mutation) Causing a complete loss of gene function, amorphic."], "synonyms": [], "antonyms": ["antinull", "non-null"], "phonetic": "/nʌl/", "examples": ["Since no date of birth was entered for the patient, his age is null."]}, "objectivity": {"definition": ["The state of being objective, just, unbiased and not influenced by emotions or personal prejudices.", "The world as it really is; reality."], "synonyms": ["objectiveness"], "antonyms": ["subjectivity"], "phonetic": "/ˌɒbd͡ʒɛkˈtɪvɪti/", "examples": []}, "obsolete": {"definition": ["(of words, equipment, etc.) No longer in use; gone into disuse; disused or neglected (often by preference for something newer, which replaces the subject).", "Imperfectly developed; not very distinct."], "synonyms": ["abortive", "obscure", "rudimental", "antiquated", "deprecated", "disused"], "antonyms": [], "phonetic": "/ˈɒbsəliːt/", "examples": ["It is speculated that, within a few years, the Internet's speedy delivery of news worldwide will make newspapers obsolete."]}, "omnipotent": {"definition": ["An omnipotent being.", "Having unlimited power, force or authority.", "Describing a cell (especially a stem cell) that is capable of developing into any type of cell or forming any type of tissue (also called a totipotent cell). See also pluripotent."], "synonyms": ["all-powerful", "almighty"], "antonyms": [], "phonetic": "/ɒmˈnɪpətənt/", "examples": []}, "onset": {"definition": ["An attack; an assault especially of an army.", "The initial phase of a disease or condition, in which symptoms first become apparent.", "The initial portion of a syllable, preceding the syllable nucleus.", "(acoustics) The beginning of a musical note or other sound, in which the amplitude rises from zero to an initial peak.", "A setting about; a beginning.", "Anything added, such as an ornament or as a useful appendage.", "To assault; to set upon.", "To set about; to begin."], "synonyms": ["beginning", "start", "storming"], "antonyms": ["coda"], "phonetic": "/ˈɒnˌsɛt/", "examples": ["the onset of schizophrenia", "the onset of puberty"]}, "opine": {"definition": ["To have or express an opinion; to state as an opinion; to suppose, consider (that).", "To give one's formal opinion (on or upon something)."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": ["\"Your decisions,\" she opined, \"have been unfailingly disastrous for this company.\"", "I had to opine on the situation because I thought a different perspective was in order."]}, "ornate": {"definition": ["To adorn; to honour.", "Elaborately ornamented, often to excess.", "Flashy, flowery or showy", "Finely finished, as a style of composition."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "oust": {"definition": ["To expel; to remove."], "synonyms": ["banish", "dismiss", "eject", "exclude"], "antonyms": ["accept", "harbor", "shelter"], "phonetic": "/ʌʊst/", "examples": ["The protesters became so noisy that they were finally ousted from the meeting."]}, "paramount": {"definition": ["A chief or superior.", "Supreme; highest; chief.", "Of the highest importance."], "synonyms": ["highest", "utmost"], "antonyms": ["paravail"], "phonetic": "/ˈpa.ɹə.maʊnt/", "examples": ["Getting those credit cards paid off is paramount."]}, "peculiar": {"definition": ["That which is peculiar; a sole or exclusive property; a prerogative; a characteristic.", "(canon law) an ecclesiastical district, parish, chapel or church outside the jurisdiction of the bishop of the diocese in which it is situated.", "Out of the ordinary; odd; strange; unusual.", "Common or usual for a certain place or circumstance; specific or particular.", "One's own; belonging solely or especially to an individual; not shared or possessed by others.", "Particular; individual; special; appropriate."], "synonyms": ["odd", "strange", "uncommon", "unusual", "specific"], "antonyms": ["common", "general", "universal", "mediocre", "ordinary", "usual"], "phonetic": "[pʰə̥ˈkʰj̊uːljʊə]", "examples": ["It would be rather peculiar to see a kangaroo hopping down a city street.", "Kangaroos are peculiar to Australia."]}, "perish": {"definition": ["To decay and disappear; to waste away to nothing.", "To decay in such a way that it can't be used for its original purpose", "To die; to cease to live.", "To cause to perish."], "synonyms": ["decease", "pass away"], "antonyms": [], "phonetic": "/ˈpɛɹɪʃ/", "examples": []}, "persecute": {"definition": ["To pursue in a manner to injure, grieve, or afflict; to beset with cruelty or malignity; to harass; especially, to afflict, harass, punish, or put to death for one's race, sexual identity, adherence to a particular religious creed, or mode of worship.", "To harass with importunity; to pursue with persistent solicitations; to annoy."], "synonyms": ["annoy", "distress", "harass", "oppress", "worry"], "antonyms": [], "phonetic": "/ˈpəːsɪkjuːt/", "examples": ["He who persecutes one will persecute all."]}, "petulant": {"definition": ["Childishly irritable", "Forward; pert; insolent; wanton."], "synonyms": ["brazen", "flippant", "impertinent", "bad-tempered", "crabby", "grouchy", "huffy", "ill-tempered", "irritable", "snappish"], "antonyms": ["easygoing"], "phonetic": "/ˈpɛtjələnt/", "examples": ["Lack of sleep is causing Dave's recent petulant behavior."]}, "pinnacle": {"definition": ["The highest point.", "A tall, sharp and craggy rock or mountain.", "An all-time high; a point of greatest achievement or success.", "An upright member, generally ending in a small spire, used to finish a buttress, to constitute a part in a proportion, as where pinnacles flank a gable or spire.", "To put something on a pinnacle.", "To build or furnish with a pinnacle or pinnacles."], "synonyms": [], "antonyms": ["nadir"], "phonetic": "/ˈpɪnəkəl/", "examples": []}, "pitiable": {"definition": ["That deserves, evokes or can be given pity; pitiful."], "synonyms": [], "antonyms": [], "phonetic": "/ˈpɪti.əbəl/", "examples": []}, "plausible": {"definition": ["Seemingly or apparently valid, likely, or acceptable; conceivably true or likely", "Obtaining approbation; specifically pleasing; apparently right; specious.", "Worthy of being applauded; praiseworthy; commendable; ready."], "synonyms": [], "antonyms": [], "phonetic": "/ˈplɔːz.ə.bəl/", "examples": ["a plausible excuse", "a plausible pretext; plausible manners; a plausible delusion"]}, "postulate": {"definition": ["Something assumed without proof as being self-evident or generally accepted, especially when used as a basis for an argument. Sometimes distinguished from axioms as being relevant to a particular science or context, rather than universally true, and following from other axioms rather than being an absolute assumption.", "A fundamental element; a basic principle.", "An axiom.", "A requirement; a prerequisite.", "To assume as a truthful or accurate premise or axiom, especially as a basis of an argument.", "To appoint or request one's appointment to an ecclesiastical office.", "To request, demand or claim for oneself.", "Postulated."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "potent": {"definition": ["A heraldic fur formed by a regular tessellation of blue and white T shapes.", "A prince; a potentate.", "A staff or crutch.", "Possessing strength.", "Powerfully effective.", "Having a sharp or offensive taste.", "(of a male) Able to procreate.", "Very powerful or effective."], "synonyms": [], "antonyms": ["counterpotent", "impotent"], "phonetic": "/ˈpəʊt(ə)nt/", "examples": ["a potent argument", "a potent medicine"]}, "pragmatic": {"definition": ["A man of business.", "A busybody.", "A public decree.", "Practical, concerned with making decisions and actions that are useful in practice, not just theory.", "Philosophical; dealing with causes, reasons, and effects, rather than with details and circumstances; said of literature.", "Interfering in the affairs of others; officious; meddlesome."], "synonyms": ["down-to-earth", "functional", "practical", "realistic", "utilitarian"], "antonyms": ["idealistic"], "phonetic": "/pɹæɡˈmætɪk/", "examples": ["The sturdy furniture in the student lounge was pragmatic, but unattractive."]}, "precedent": {"definition": ["An act in the past which may be used as an example to help decide the outcome of similar instances in the future.", "A decided case which is cited or used as an example to justify a judgment in a subsequent case.", "An established habit or custom.", "(with definite article) The aforementioned (thing).", "The previous version.", "A rough draught of a writing which precedes a finished copy.", "To provide precedents for.", "To be a precedent for.", "Happening or taking place earlier in time; previous or preceding.", "Coming before in a particular order or arrangement; preceding, foregoing."], "synonyms": [], "antonyms": [], "phonetic": "/pɹɪˈsiː.dənt/", "examples": []}, "predecessor": {"definition": ["One who precedes; one who has preceded another in any state, position, office, etc.; one whom another follows or comes after, in any office or position.", "A model or type of machinery or device which precedes the current one. Usually used to describe an earlier, outdated model.", "A vertex having a directed path to another vertex"], "synonyms": ["foreganger", "forerunner"], "antonyms": ["successor"], "phonetic": "/ˈpɹiːdɪsɛsɚ/", "examples": []}, "prescribe": {"definition": ["To order (a drug or medical device) for use by a particular patient (under licensed authority).", "To specify by writing as a required procedure or ritual; to lay down authoritatively as a guide, direction, or rule of action."], "synonyms": [], "antonyms": ["proscribe"], "phonetic": "/pɹɪˈskɹaɪb/", "examples": ["The doctor prescribed aspirin.", "The property meets the criteria prescribed by the regulations."]}, "principle": {"definition": ["A fundamental assumption or guiding belief.", "A rule used to choose among solutions to a problem.", "(sometimes pluralized) Moral rule or aspect.", "A rule or law of nature, or the basic idea on how the laws of nature are applied.", "A fundamental essence, particularly one producing a given quality.", "A beginning.", "A source, or origin; that from which anything proceeds; fundamental substance or energy; primordial substance; ultimate element, or cause.", "An original faculty or endowment.", "To equip with principles; to establish, or fix, in certain principles; to impress with any tenet or rule of conduct."], "synonyms": ["tenet"], "antonyms": [], "phonetic": "/ˈpɹɪnsəpəl/", "examples": ["We need some sort of principles to reason from.", "The principle of least privilege holds that a process should only receive the permissions it needs.", "I don't doubt your principles.", "Bernoulli's Principle", "Many believe that life is the result of some vital principle."]}, "prohibit": {"definition": ["To forbid, disallow, or proscribe officially; to make illegal or illicit."], "synonyms": ["ban", "disallow", "forbid"], "antonyms": ["allow", "authorize"], "phonetic": "/pɹəʊˈhɪbɪt/", "examples": ["The restaurant prohibits smoking on the patio."]}, "prompt": {"definition": ["A reminder or cue.", "A time limit given for payment of an account for produce purchased, this limit varying with different goods.", "A sequence of characters that appears on a monitor to indicate that the computer is ready to receive input.", "(writing) A suggestion for inspiration given to an author.", "To lead (someone) toward what they should say or do.", "To show or tell an actor/person the words they should be saying, or actions they should be doing.", "To initiate; to cause or lead to.", "Quick; acting without delay.", "On time; punctual.", "Ready; willing to act."], "synonyms": ["hasty", "timely", "good to go", "yare"], "antonyms": [], "phonetic": "/pɹɒmpt/", "examples": ["I filled in my name where the prompt appeared on the computer screen but my account wasn't recognized.", "I prompted him to get a new job.", "If he forgets his words I will prompt him.", "He was very prompt at getting a new job.", "Be prompt for your appointment."]}, "promulgate": {"definition": ["To make known or public.", "To put into effect as a regulation."], "synonyms": ["carry out", "execute", "implement", "put into effect", "declare", "proclaim", "publish"], "antonyms": ["abrogate", "withhold"], "phonetic": "/ˈpɹɒml̩.ɡeɪt/", "examples": []}, "prosecute": {"definition": ["To start criminal proceedings against.", "To charge, try.", "To seek to obtain by legal process.", "To pursue something to the end."], "synonyms": [], "antonyms": [], "phonetic": "/ˈpɹɒsɪkjuːt/", "examples": ["to prosecute a man for trespass, or for a riot", "to prosecute a right or a claim in a court of law", "to prosecute a scheme, hope, or claim"]}, "provocative": {"definition": ["(obsolescent) Something that provokes an appetite, especially a sexual appetite; an aphrodisiac.", "Serving or tending to elicit a strong, often negative sentiment in another person; exasperating.", "Serving or tending to excite, stimulate or arouse sexual interest; sexy."], "synonyms": [], "antonyms": [], "phonetic": "/pɹəˈvɒk.ə.tɪv/", "examples": []}, "qualitative": {"definition": ["Something qualitative.", "Of descriptions or distinctions based on some quality rather than on some quantity.", "Of a form of analysis that yields the identity of a compound."], "synonyms": [], "antonyms": [], "phonetic": "/ˈkwɒl.ɪ.tə.tɪv/", "examples": []}, "quantitative": {"definition": ["Of a measurement based on some quantity or number rather than on some quality", "Of a form of analysis that determines the amount of some element or compound in a sample"], "synonyms": [], "antonyms": [], "phonetic": "/ˈkwɒntətɪv/", "examples": []}, "quirk": {"definition": ["An idiosyncrasy; a slight glitch, mannerism; something unusual about the manner or style of something or someone", "An acute angle dividing a molding; a groove that runs lengthwise between the upper part of a moulding and a soffit", "A quibble, evasion, or subterfuge.", "To move with a wry jerk.", "To furnish with a quirk or channel.", "To use verbal tricks or quibbles"], "synonyms": [], "antonyms": [], "phonetic": "/kwɜːk/", "examples": ["The car steers cleanly, but the gearshift has a few quirks.", "He quirked an eyebrow."]}, "ramify": {"definition": ["To divide into branches or subdivisions.", "To spread or diversify into multiple fields or categories."], "synonyms": ["branch"], "antonyms": [], "phonetic": "", "examples": ["to ramify an art, subject, scheme"]}, "rash": {"definition": ["Acting too quickly without considering the risks and consequences; not careful; hasty.", "So dry as to fall out of the ear with handling, as corn.", "Requiring sudden action; pressing; urgent.", "Fast-acting."], "synonyms": ["brash", "heady", "hotheaded", "impulsive", "inconsiderate", "precipitate"], "antonyms": [], "phonetic": "/ɹæʃ/", "examples": ["rash words spoken in the heat of debate"]}, "raw": {"definition": ["(sugar refining, sugar trade) An unprocessed sugar; a batch of such.", "A galled place; an inveterate sore.", "(by extension) A point about which a person is particularly sensitive.", "A recording or rip of a show that has not been fansubbed.", "A scan that has not been cleaned (purged of blemishes arising from the scanning process) and has not been scanlated.", "(of food) Not cooked.", "(of materials, products, etc.) Not treated or processed; in a natural state, unrefined, unprocessed.", "Having had the skin removed or abraded; chafed, tender; exposed, lacerated.", "New or inexperienced.", "Crude in quality; rough, uneven, unsophisticated.", "(of data) Uncorrected, without analysis.", "(of weather) Unpleasantly cold or damp.", "(of an emotion, personality, etc.) Unmasked, undisguised, strongly expressed", "Candid in a representation of unpleasant facts, conditions, etc.", "(of language) Unrefined, crude, or insensitive, especially with reference to sexual matters", "Not covered; bare; bald.", "Without a condom."], "synonyms": [], "antonyms": [], "phonetic": "/ɹɔː/", "examples": ["raw cane sugar", "a raw wound", "a raw beginner", "a raw voice", "a raw wind", "raw emotion", "a raw description of the American political arena", "We did it raw."]}, "readily": {"definition": ["Without unwillingness or hesitation; showing readiness.", "Without impediment, easily."], "synonyms": [], "antonyms": [], "phonetic": "/ˈɹɛdɪli/", "examples": ["The suspect readily answered all questions the police officers asked him.", "readily available;  readily achievable"]}, "reconsideration": {"definition": ["The act of reconsidering or something reconsidered"], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "reform": {"definition": ["The change of something that is defective, broken, inefficient or otherwise negative, in order to correct or improve it", "To put into a new and improved form or condition; to restore to a former good state, or bring from bad to good; to change from worse to better", "To return to a good state; to amend or correct one's own character or habits", "To form again or in a new configuration."], "synonyms": ["amendment", "correction", "rectification", "reformation", "amend", "better", "correct", "improve", "mend", "reclaim", "rectify", "repair", "restore"], "antonyms": [], "phonetic": "/ɹɪˈfɔːm/", "examples": ["A major reform is needed to improve the efficiency in the factory.", "1909, H. G. Wells, The History of Mr. Polly Chapter 9", "It is hoped that many criminals, upon being freed, will eventually reform.", "The regiment reformed after surviving the first attack."]}, "refute": {"definition": ["To prove (something) to be false or incorrect.", "To deny the truth or correctness of (something)."], "synonyms": ["debunk", "disprove", "rebut", "deny", "gainsay", "reject", "repudiate"], "antonyms": ["accept", "embrace", "demonstrate", "prove"], "phonetic": "", "examples": []}, "reinforce": {"definition": ["To strengthen, especially by addition or augmentation.", "To emphasize or review.", "To encourage (a behavior or idea) through repeated stimulus."], "synonyms": ["emphasize", "repeat", "review", "encourage", "instruct", "learn", "reward", "teach", "augment", "bolster", "buttress", "fortify", "line", "strengthen"], "antonyms": [], "phonetic": "/ˌɹiːɪnˈfɔː(ɹ)s/", "examples": ["He reinforced the handle with a metal rod and a bit of tape.", "The right homework will reinforce and complement the lesson!", "Advertising for fast food can reinforce unhealthy dietary tendencies."]}, "reluctantly": {"definition": ["In a reluctant or hesitant manner."], "synonyms": [], "antonyms": [], "phonetic": "/ɹɪˈlʌktəntli/", "examples": []}, "renounce": {"definition": ["An act of renouncing.", "To give up, resign, surrender, atsake.", "To cast off, repudiate.", "To decline further association with someone or something, disown.", "To abandon, forsake, discontinue (an action, habit, intention, etc), sometimes by open declaration.", "To make a renunciation of something.", "To surrender formally some right or trust.", "To fail to follow suit; playing a card of a different suit when having no card of the suit led."], "synonyms": ["forsay", "forswear"], "antonyms": [], "phonetic": "/ɹɪˈnaʊns/", "examples": ["to renounce a title to land or to a throne"]}, "reproach": {"definition": ["A mild rebuke, or an implied criticism.", "Disgrace or shame.", "An object of scorn.", "To criticize or rebuke (someone).", "To disgrace, or bring shame upon."], "synonyms": ["obloquy", "opprobrium", "blame", "rebuke", "upbraid", "disgrace", "dishonor"], "antonyms": [], "phonetic": "", "examples": []}, "repudiate": {"definition": ["To reject the truth or validity of; to deny.", "To refuse to have anything to do with; to disown.", "To refuse to pay or honor (a debt).", "To be repudiated."], "synonyms": ["contradict", "deny", "gainsay", "disavow", "forswear", "welsh"], "antonyms": [], "phonetic": "", "examples": []}, "retention": {"definition": ["The act of retaining or something retained", "The act or power of remembering things", "A memory; what is retained in the mind", "The involuntary withholding of urine and faeces", "The length of time an individual remains in treatment", "That which contains something, as a tablet; a means of preserving impressions.", "The act of withholding; restraint; reserve.", "A place of custody or confinement.", "The right to withhold a debt, or of retaining property until a debt due to the person claiming the right is duly paid; a lien."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "satiated": {"definition": ["To fill to satisfaction; to satisfy.", "To satisfy to excess. To fill to satiety.", "Pleasantly satisfied or full, as with food; sated"], "synonyms": ["sate"], "antonyms": [], "phonetic": "", "examples": ["Nothing seemed to satiate her desire for knowledge."]}, "savvy": {"definition": ["Shrewdness.", "To understand.", "Shrewd, well-informed and perceptive."], "synonyms": ["canny"], "antonyms": [], "phonetic": "/ˈsæ.vi/", "examples": []}, "scandalous": {"definition": ["Wrong, immoral, causing a scandal", "Malicious, defamatory.", "Outrageous; exceeding reasonable limits."], "synonyms": [], "antonyms": [], "phonetic": "/ˈskændələs/", "examples": []}, "scorn": {"definition": ["Contempt or disdain.", "A display of disdain; a slight.", "An object of disdain, contempt, or derision.", "To feel or display contempt or disdain for something or somebody; to despise.", "To reject, turn down.", "To refuse to do something, as beneath oneself.", "To scoff, to express contempt."], "synonyms": ["deride", "mock", "ridicule", "scoff", "sneer"], "antonyms": [], "phonetic": "/skɔːn/", "examples": ["He scorned her romantic advances.", "She scorned to show weakness."]}, "scrupulous": {"definition": ["Exactly and carefully conducted.", "Having scruples or compunctions.", "Precise; exact or strict"], "synonyms": ["ethical", "fair", "honourable", "just", "minded", "moral", "righteous", "meticulous", "painstaking", "worried"], "antonyms": ["unscrupulous"], "phonetic": "/ˈskɹu.pjə.ləs/", "examples": ["He is scrupulous in his finances.", "He is a scrupulous businessman and always acts in the best interest of his company."]}, "scrutinize": {"definition": ["To examine something with great care or detail, as to look for hidden or obscure flaws.", "To audit accounts etc in order to verify them."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": ["to scrutinize the conduct or motives of individuals"]}, "secrete": {"definition": ["Separated"], "synonyms": [], "antonyms": [], "phonetic": "/sɪˈkɹiːt/", "examples": []}, "sentiment": {"definition": ["A general thought, feeling, or sense.", "Feelings, especially tender feelings, as apart from reason or judgment, or of a weak or foolish kind."], "synonyms": [], "antonyms": [], "phonetic": "/ˈsɛn.tɪ.mənt/", "examples": ["The sentiment emerged that we were acting too soon."]}, "sheer": {"definition": ["A sheer curtain or fabric.", "Very thin or transparent.", "Pure in composition; unmixed; unadulterated.", "(by extension) Downright; complete; pure.", "Used to emphasize the amount or degree of something.", "Very steep; almost vertical or perpendicular.", "Clean; quite; at once."], "synonyms": ["downright", "mere", "pure", "unmitigated", "undiluted", "perpendicular", "steep", "vertical", "diaphanous", "see-through", "thin"], "antonyms": [], "phonetic": "", "examples": ["Use sheers to maximize natural light.", "Her light, sheer dress caught everyone’s attention.", "I think it is sheer genius to invent such a thing.", "The army's sheer size made it impossible to resist.", "It was a sheer drop of 180 feet."]}, "simple": {"definition": ["A herbal preparation made from one plant, as opposed to something made from more than one plant.", "(by extension) A physician.", "A simple or atomic proposition.", "Something not mixed or compounded.", "A drawloom.", "Part of the apparatus for raising the heddles of a drawloom.", "A feast which is not a double or a semidouble.", "To gather simples, i.e. medicinal herbs.", "Uncomplicated; taken by itself, with nothing added.", "Without ornamentation; plain.", "Free from duplicity; guileless, innocent, straightforward.", "Undistinguished in social condition; of no special rank.", "Trivial; insignificant.", "Feeble-minded; foolish.", "(heading) Structurally uncomplicated.", "Mere; not other than; being only."], "synonyms": ["onefold", "plain"], "antonyms": ["complex", "complicated", "compound", "subtle", "gentle"], "phonetic": "/ˈsɪmpəl/", "examples": []}, "sinister": {"definition": ["Inauspicious, ominous, unlucky, illegitimate (as in bar sinister).", "Evil or seemingly evil; indicating lurking danger or harm.", "Of the left side.", "On the left side of a shield from the wearer's standpoint, and the right side to the viewer.", "Wrong, as springing from indirection or obliquity; perverse; dishonest."], "synonyms": [], "antonyms": ["dexter"], "phonetic": "", "examples": ["sinister influences"]}, "solidarity": {"definition": ["A bond of unity or agreement between individuals, united around a common goal or against a common enemy, such as the unifying principle that defines the labor movement; mutual support within a group.", "Willingness to give psychological and/or material support when another person is in a difficult position or needs affection."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": ["A long time union member himself, Phil showed solidarity with the picketing grocery store workers by shopping at a competing, unionized store.", "Only the solidarity provided by her siblings allowed Margaret to cope with her mother's harrowing death."]}, "sparingly": {"definition": ["In a sparing manner; with frugality, moderation, scantiness, reserve, forbearance, or the like; sparsely."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "spawn": {"definition": ["To produce or deposit (eggs) in water.", "To generate, bring into being, especially non-mammalian beings in very large numbers.", "To bring forth in general.", "To induce (aquatic organisms) to spawn.", "To plant with fungal spawn.", "To deposit (numerous) eggs in water.", "To reproduce, especially in large numbers.", "(of a character or object) (To cause) to appear spontaneously in a game at a certain point and time."], "synonyms": [], "antonyms": [], "phonetic": "/ˈspɔːn/", "examples": ["The Web server spawns a new process to handle each client's request."]}, "spur": {"definition": ["A rigid implement, often roughly y-shaped, that is fixed to one's heel for the purpose of prodding a horse. Often worn by, and emblematic of, the cowboy or the knight.", "A jab given with the spurs.", "Anything that inspires or motivates, as a spur does a horse.", "An appendage or spike pointing rearward, near the foot, for instance that of a rooster.", "Any protruding part connected at one end, for instance a highway that extends from another highway into a city.", "Roots, tree roots.", "A mountain that shoots from another mountain or range and extends some distance in a lateral direction, or at right angles.", "A spiked iron worn by seamen upon the bottom of the boot, to enable them to stand upon the carcass of a whale to strip off the blubber.", "A brace strengthening a post and some connected part, such as a rafter or crossbeam; a strut.", "The short wooden buttress of a post.", "A projection from the round base of a column, occupying the angle of a square plinth upon which the base rests, or bringing the bottom bed of the base to a nearly square form. It is generally carved in leafage.", "Ergotized rye or other grain.", "A wall in a fortification that crosses a part of a rampart and joins to an inner wall.", "A piece of timber fixed on the bilgeways before launching, having the upper ends bolted to the vessel's side.", "A curved piece of timber serving as a half to support the deck where a whole beam cannot be placed.", "A branch of a vein.", "A very short branch line of a railway line.", "A short thin side shoot from a branch, especially one that bears fruit or, in conifers, the shoots that bear the leaves.", "To prod (especially a horse) on the side or flank, with the intent to urge motion or haste, to gig.", "To urge or encourage to action, or to a more vigorous pursuit of an object", "To put spurs on.", "To press forward; to travel in great haste."], "synonyms": ["drive", "impel", "incite", "instigate", "stimulate"], "antonyms": [], "phonetic": "/spɜː/", "examples": ["to spur boots"]}, "squalid": {"definition": ["Extremely dirty and unpleasant.", "Showing a contemptible lack of moral standards."], "synonyms": [], "antonyms": [], "phonetic": "/ˈskwɒlɪd/", "examples": ["A squalid attempt to buy votes."]}, "stark": {"definition": ["Hard, firm; obdurate.", "Severe; violent; fierce (now usually in describing the weather).", "Strong; vigorous; powerful.", "Stiff, rigid.", "Plain in appearance; barren, desolate.", "Complete, absolute, full.", "Starkly; entirely, absolutely"], "synonyms": [], "antonyms": [], "phonetic": "/stɑːk/", "examples": ["I picked my way forlornly through the stark, sharp rocks.", "A flower was growing, in stark contrast, out of the sidewalk.", "He's gone stark, staring mad."]}, "static": {"definition": ["Interference on a broadcast signal caused by atmospheric disturbances; heard as crackles on radio, or seen as random specks on television.", "(by extension) Interference or obstruction from people.", "Static electricity.", "A static caravan.", "Verbal abuse.", "A static variable.", "Unchanging; that cannot or does not change.", "Immobile; fixed in place; having no motion.", "Computed, created or allocated before the program starts running, and usually not changeable at runtime", "Defined for the class itself, as opposed to instances of it; thus shared between all instances and accessible even without an instance."], "synonyms": ["stable", "still"], "antonyms": ["dynamic", "kinetic", "mobile", "moving", "nonstatic"], "phonetic": "/ˈstæt.ɪk/", "examples": []}, "subordinate": {"definition": ["One who is subordinate.", "To make subservient.", "To treat as of less value or importance.", "To make of lower priority in order of payment in bankruptcy.", "Placed in a lower class, rank, or position.", "Submissive or inferior to, or controlled by authority.", "(grammar, of a clause) dependent on and either modifying or complementing the main clause", "Descending in a regular series."], "synonyms": ["inferior", "junior", "report", "underling", "understrapper", "belittle", "denigrate", "dependent", "lesser"], "antonyms": ["boss", "commander", "leader", "manager", "superior", "supervisor", "independent", "main", "insubordinate", "superordinate"], "phonetic": "", "examples": ["In the sentence “The barbecue finished before John arrived”, the subordinate clause “before John arrived” specifies the time of the main clause, “The barbecue finished”."]}, "subsequently": {"definition": ["Following, afterwards in either time or place.", "Accordingly, therefore (implying a logical connection or deduction)."], "synonyms": ["as a result", "whence", "ensuingly", "followingly", "afterwards", "yet"], "antonyms": [], "phonetic": "", "examples": []}, "substantial": {"definition": ["Anything having substance; an essential part.", "Having a substance; actually existing.", "Not imaginary; real; actual; true; veritable.", "Corporeal; material; firm.", "Having good substance; strong; stout; solid; firm.", "Possessed of goods or an estate; moderately wealthy.", "Large in size, quantity, or value; ample; significant.", "Most important; essential.", "Satisfying; having sufficient substance to be nourishing or filling."], "synonyms": [], "antonyms": [], "phonetic": "/səbˈstænʃəl/", "examples": ["substantial life", "a substantial fence or wall", "a substantial freeholder", "A substantial number of people went to the event.", "I don't just want a snack; I need something substantial."]}, "substantiate": {"definition": ["To verify something by supplying evidence; to authenticate or corroborate", "To give material form or substance to something; to embody; to record in documents"], "synonyms": [], "antonyms": [], "phonetic": "/səbˈstanʃɪeɪt/", "examples": []}, "subtle": {"definition": ["Hard to grasp; not obvious or easily understood; barely noticeable.", "(of a thing) Cleverly contrived.", "(of a person or animal) Cunning, skillful.", "Insidious.", "Tenuous; rarefied; of low density or thin consistency.", "Refined; exquisite."], "synonyms": ["crafty", "cunning", "skillful", "deceptive", "malicious"], "antonyms": ["simple"], "phonetic": "/ˈsʌt(ə)l/", "examples": ["The difference is subtle, but you can hear it if you listen carefully."]}, "sufficient": {"definition": ["Equal to the end proposed; adequate to what is needed; enough", "Possessing adequate talents or accomplishments; of competent power or ability; qualified; fit.", "Capable of meeting obligations; responsible.", "Having enough money to meet obligations and live comfortably."], "synonyms": ["ample", "competent"], "antonyms": ["insufficient", "nonsufficient", "unsufficient"], "phonetic": "/səˈfɪʃənt/", "examples": ["There is not sufficient access to the internet in many small rural villages.", "A two-week training course is sufficient to get a job in the coach-driving profession."]}, "surly": {"definition": ["Irritated, bad-tempered, unfriendly.", "Threatening, menacing, gloomy.", "Lordly, arrogant, supercilious.", "In an arrogant or supercilious manner."], "synonyms": [], "antonyms": [], "phonetic": "/ˈsɜːli/", "examples": ["The surly weather put us all in a bad mood."]}, "surmount": {"definition": ["To get over; to overcome.", "To cap; to sit on top off."], "synonyms": [], "antonyms": [], "phonetic": "/səˈmaʊnt/", "examples": []}, "susceptible": {"definition": ["A person who is vulnerable to being infected by a certain disease", "Likely to be affected by something", "Easily influenced or tricked; credulous", "Especially sensitive, especially to a stimulus", "That, when subjected to a specific operation, will yield a specific result", "Vulnerable; (temporarily) defenseless"], "synonyms": [], "antonyms": [], "phonetic": "/səˈsɛptɪbl̩/", "examples": ["He was susceptible to minor ailments.", "A properly prepared surface is susceptible of an enduring paint job."]}, "tactful": {"definition": ["Possessing tact; able to deal with people in a sensitive manner."], "synonyms": [], "antonyms": ["tactless"], "phonetic": "", "examples": []}, "taut": {"definition": ["To make taut; to tauten, to tighten.", "Under tension, like a stretched bowstring, rope, or sail; tight.", "(of a body, muscles, etc.) Not flabby; firm, toned; (of a person) having a lean, strong body.", "(of music, writing, etc.) Containing only relevant parts; brief and controlled.", "Experiencing anxiety or stress.", "(of a sailor, a ship, etc.) Neat and well-disciplined; (by extension) efficient and in order.", "Strong; uncompromising."], "synonyms": ["concise", "crisp", "terse", "tight", "nonrelaxed", "strained", "tense", "unrelaxed", "nonslack", "stretched", "tensioned"], "antonyms": ["untaut"], "phonetic": "/tɔːt/", "examples": []}, "teeming": {"definition": ["To be stocked to overflowing.", "To be prolific; to abound; to be rife.", "To bring forth young, as an animal; to produce fruit, as a plant; to bear; to be pregnant; to conceive; to multiply.", "To empty.", "To pour (especially with rain)", "To pour, as steel, from a melting pot; to fill, as a mould, with molten metal.", "To think fit.", "Abundantly filled with especially living things.", "Referring to large quantities of rain."], "synonyms": [], "antonyms": [], "phonetic": "/ˈtiːmɪŋ/", "examples": ["Fish teem in this pond."]}, "temperament": {"definition": ["A moderate and proportionable mixture of elements or ingredients in a compound; the condition in which elements are mixed in their proper proportions.", "Any state or condition as determined by the proportion of its ingredients or the manner in which they are mixed; consistence, composition; mixture.", "A person's usual manner of thinking, behaving or reacting.", "A tendency to become irritable or angry.", "The altering of certain intervals from their correct values in order to improve the moving from key to key.", "Individual differences in behavior that are biologically based and are relatively independent of learning, system of values and attitudes."], "synonyms": [], "antonyms": [], "phonetic": "/ˈtɛmpəɹmənt/", "examples": []}, "tentative": {"definition": ["A trial; an experiment; an attempt.", "Of or pertaining to a trial or trials; essaying; experimental.", "Uncertain; subject to future change."], "synonyms": [], "antonyms": [], "phonetic": "/ˈtɛntətɪv/", "examples": []}, "transparent": {"definition": ["(of a material or object) See-through, clear; having the property that light passes through it almost undisturbed, such that one can see through it clearly.", "(of a system or organization) Open, public; having the property that theories and practices are publicly visible, thereby reducing the chance of corruption.", "Obvious; readily apparent; easy to see or understand.", "Having the property of transparency, i.e. sufficiently accurate that the compressed result is perceptually indistinguishable from the uncompressed input.", "Not noticeable because it happens automatically or in the background; invisible."], "synonyms": ["apparent", "clear", "obvious", "crystalline", "diaphanous", "limpid", "see-through"], "antonyms": ["obscure", "opaque", "nontransparent"], "phonetic": "/tɹæn(t)sˈpæɹənt/", "examples": ["The waters of the lake were transparent until the factory dumped waste there.", "His reasons for the decision were transparent."]}, "treacherous": {"definition": ["Exhibiting treachery.", "Deceitful; inclined to betray.", "Unreliable; dangerous."], "synonyms": [], "antonyms": ["loyal"], "phonetic": "/ˈtɹɛtʃəɹəs/", "examples": ["a treacherous mountain trail"]}, "tremendous": {"definition": ["Awe-inspiring; terrific.", "Notable for its size, power, or excellence.", "Extremely large (in amount, extent, degree, etc.) or great"], "synonyms": [], "antonyms": [], "phonetic": "/tɹəˈmɛndəs/", "examples": ["Van Beethoven's ninth symphony is a tremendous piece of music.", "There was a tremendous outpouring of support."]}, "ubiquitous": {"definition": ["Being everywhere at once: omnipresent.", "Appearing to be everywhere at once; being or seeming to be in more than one location at the same time.", "Widespread; very prevalent."], "synonyms": ["common", "pervasive", "ever-present", "omnipresent"], "antonyms": [], "phonetic": "", "examples": ["To Hindus, Jews, Christians, and Muslims, God is ubiquitous."]}, "unadorned": {"definition": ["To add a feature or embellishment that makes something uglier; uglify.", "To remove the adornments from.", "Having no additional decoration or embellishment; plain and simple"], "synonyms": [], "antonyms": [], "phonetic": "/əˌnʌˈdɔːnd/", "examples": []}, "undermine": {"definition": ["To dig underneath (something), to make a passage for destructive or military purposes; to sap.", "To weaken or work against; to hinder, sabotage.", "To erode the base or foundation of something, e.g. by the action of water."], "synonyms": [], "antonyms": ["undergird"], "phonetic": "/ʌndəˈmaɪn/", "examples": ["The war efforts were undermined by the constant bickering between the allies."]}, "underscore": {"definition": ["An underline; a line drawn or printed beneath text; the character _.", "A piece of background music.", "To underline; to mark a line beneath text.", "To emphasize or draw attention to."], "synonyms": [], "antonyms": [], "phonetic": "/ˈʌn.də(ɹ)ˌskɔː(ɹ)/", "examples": ["I wish to underscore the importance of proper formatting."]}, "undulate": {"definition": ["To cause to move in a wavelike motion.", "To cause to resemble a wave", "To move in wavelike motions.", "To appear wavelike.", "Wavy in appearance or form.", "Changing the pitch and volume of one's voice.", "(of a margin) sinuous, winding up and down."], "synonyms": [], "antonyms": [], "phonetic": "/ˈʌndjəleɪt/", "examples": []}, "unilateral": {"definition": ["Done by one side only.", "Affecting only one side of the body.", "Binding or affecting one party only."], "synonyms": [], "antonyms": [], "phonetic": "[ˌjʉː.nɪˈlæt.ə.ɹɫ̩]", "examples": []}, "unjust": {"definition": ["Not fair, just or right."], "synonyms": ["unfair"], "antonyms": ["just"], "phonetic": "/ʌnˈdʒʌst/", "examples": ["The solution was very unjust."]}, "unmitigated": {"definition": ["Not mitigated.", "(intensifier) Total, complete, utter."], "synonyms": [], "antonyms": [], "phonetic": "", "examples": []}, "unprecedented": {"definition": ["Never before seen, done, or experienced; without precedent."], "synonyms": [], "antonyms": [], "phonetic": "/ʌnˈpɹɛsɪdɛntɪd/", "examples": []}, "unveil": {"definition": ["To remove a veil from; to uncover; to reveal something hidden.", "To remove a veil; to reveal oneself."], "synonyms": ["expose", "uncloak"], "antonyms": [], "phonetic": "/ʌnˈveɪl/", "examples": []}, "urge": {"definition": ["A strong desire; an itch to do something.", "To press; to push; to drive; to impel; to force onward.", "To press the mind or will of; to ply with motives, arguments, persuasion, or importunity.", "To provoke; to exasperate.", "To press hard upon; to follow closely.", "To present in an urgent manner; to insist upon.", "To treat with forcible means; to take severe or violent measures with.", "To press onward or forward.", "To be pressing in argument; to insist; to persist."], "synonyms": ["animate", "encourage", "impel", "incite", "instigate", "stimulate"], "antonyms": [], "phonetic": "/ɜːd͡ʒ/", "examples": ["to urge an argument; to urge the necessity of a case", "to urge an ore with intense heat"]}, "validate": {"definition": ["To render valid.", "To check or prove the validity of; verify.", "To have its validity successfully proven."], "synonyms": [], "antonyms": ["disprove", "invalidate"], "phonetic": "/ˈvæl.ɪ.deɪt/", "examples": ["The data file cannot be imported because it doesn't validate."]}, "viability": {"definition": ["The property of being viable; the ability to live or to succeed"], "synonyms": [], "antonyms": [], "phonetic": "/ˌvaɪəˈbɪlɪti/", "examples": []}, "vital": {"definition": ["Relating to, or characteristic of life.", "Necessary to the continuation of life; being the seat of life; being that on which life depends.", "Invigorating or life-giving.", "Necessary to continued existence.", "Relating to the recording of life events.", "Very important.", "Containing life; living.", "Capable of living; in a state to live; viable."], "synonyms": ["crucial", "necessary", "significant", "extant", "kicking", "live", "lifely"], "antonyms": ["mortal"], "phonetic": "/ˈvaɪt̬əl/", "examples": ["vital energies; vital functions; vital actions", "The brain is a vital organ.", "The transition to farming was vital for the creation of civilisation.", "Birth, marriage and death certificates are vital records.", "It is vital that you don't forget to do your homework."]}, "vow": {"definition": ["A solemn promise to perform some act, or behave in a specified manner, especially a promise to live and act in accordance with the rules of a religious order.", "A declaration or assertion.", "A votive offering.", "To make a vow; to promise.", "To make a vow regarding (something).", "To declare publicly that one has made a vow, usually to show one's determination or to announce an act of retaliation."], "synonyms": [], "antonyms": [], "phonetic": "/vaʊ/", "examples": ["The old hermit, up in the mountains, took a vow of silence.", "The wronged woman vowed revenge.", "The rebels vowed to continue their fight."]}, "warrant": {"definition": ["Authorization or certification; a sanction, as given by a superior.", "Something that provides assurance or confirmation; a guarantee or proof.", "An order that serves as authorization; especially a voucher authorizing payment or receipt of money.", "An option, usually issued together with another security and with a term at issue greater than a year, to buy other securities of the issuer.", "A judicial writ authorizing an officer to make a search, seizure, or arrest, or to execute a judgment.", "Short for warrant officer.", "A document certifying that a motor vehicle meets certain standards of mechanical soundness and safety; a warrant of fitness.", "A defender, a protector.", "Underclay in a coal mine.", "To protect, keep safe (from danger).", "To give (someone) an assurance or guarantee (of something); also, with a double object: to guarantee (someone something).", "To guarantee (something) to be (of a specified quality, value, etc.).", "To guarantee as being true; (colloquially) to believe strongly.", "To authorize; to give (someone) sanction or warrant (to do something).", "To justify; to give grounds for."], "synonyms": ["warren earth"], "antonyms": [], "phonetic": "", "examples": ["a warrant of authenticity; a warrant for success", "an arrest warrant issued by the court", "That tree is going to fall, I’ll warrant.", "I am warranted to search these premises fully.", "Circumstances arose that warranted the use of lethal force."]}, "yield": {"definition": ["To pay, give in payment; repay, recompense; reward; requite.", "To furnish; to afford; to render; to give forth.", "To give way; to allow another to pass first.", "To give as required; to surrender, relinquish or capitulate.", "To give, or give forth, (anything).", "To give way; to succumb to a force.", "To produce as return, as from an investment.", "To produce as a result.", "To produce a particular sound as the result of a sound law.", "(of a material specimen) To pass the material's yield point and undergo plastic deformation.", "To admit to be true; to concede; to allow."], "synonyms": ["bear", "capitulate", "cede", "defer", "give in", "give up", "give way", "produce", "relent", "submit", "succumb", "supply", "surrender", "trade away"], "antonyms": [], "phonetic": "/jiːld/", "examples": ["Yield the right of way to pedestrians.", "They refuse to yield to the enemy.", "Historically, that security yields a high return.", "Adding 3 and 4 yields a result of 7.", "Indo-European p- yields Germanic f-."]}}